{"format": "json", "view": "div", "doc": "p5.xml", "root": "1.7.2.13", "id": "AB", "odd": "tei.odd", "next": "1.7.2.15", "previous": "1.7.2.11", "nextId": "SG", "previousId": "FM1", "switchView": null, "content": "<!DOCTYPE html>\n\n<div class=\"content\"><section class=\"tei-div9\" data-tei=\"1.7.2.13\" id=\"AB\">\n<h1 class=\"tei-head9\" data-tei=\"1.7.2.13.5\">4 About These Guidelines</h1>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.7\">These Guidelines have been developed and are maintained by the Text\nEncoding Initiative Consortium (TEI); see <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.7.2\" emit=\"transcription\" hash=\"ABTEI\" xml-id=\"ABTEI\">4.2 Historical Background</pb-link>.  They\nare addressed to anyone who works with any kind of textual resource in\ndigital form.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.9\">They make recommendations about suitable ways of representing those\nfeatures of textual resources which need to be identified explicitly\nin order to facilitate processing by computer programs.  In\nparticular, they specify a set of markers (or <span class=\"tei-term\" data-tei=\"1.7.2.13.9.2\">tags</span>) which\nmay be inserted in the electronic representation of the text, in order\nto mark the text structure and other features of interest.  Many, or\nmost, computer programs depend on the presence of such explicit\nmarkers for their functionality, since without them a digitized text\nappears to be nothing but a sequence of undifferentiated bits.  The\nsuccess of the World Wide Web, for example, is partly a consequence of\nits use of such markup to indicate such features as headings and lists\non individual pages, and to indicate links between pages. The process\nof inserting such explicit markers for implicit textual features is\noften called markup, or equivalently within this\nwork encoding; the term\ntagging is also used informally. We use the term\n<span class=\"tei-term\" data-tei=\"1.7.2.13.9.10\">encoding scheme</span> or <span class=\"tei-term\" data-tei=\"1.7.2.13.9.12\">markup language</span> to denote\nthe complete set of rules associated with the use of markup in a given\ncontext; we use the term <span class=\"tei-term\" data-tei=\"1.7.2.13.9.14\">markup vocabulary</span> for the\nspecific set of markers or named distinctions employed by a given\nencoding scheme. Thus, this work both describes the TEI encoding\nscheme, and documents the TEI markup vocabulary.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.11\">The TEI encoding scheme is of particular usefulness in facilitating\nthe loss-free interchange of data amongst individuals and research\ngroups using different programs, computer systems, or application\nsoftware. Since they contain an inventory of the features most often\ndeployed for computer-based text processing, these Guidelines are also\nuseful as a starting point for those designing new systems and\ncreating new materials, even where interchange of information is not a\nprimary objective. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.13\">These Guidelines apply to texts in any natural language, of any\ndate, in any literary genre or text type, without restriction on form\nor content.  They treat both continuous materials (running\ntext) and discontinuous materials such as dictionaries and\nlinguistic corpora.  Though principally directed to the needs of the\nscholarly research community, these Guidelines are not restricted to\nesoteric academic applications.  They are also useful for librarians\nmaintaining and documenting electronic materials, and for publishers\nand others creating or distributing electronic texts.  Although they\nfocus on problems of representing in electronic form texts which\nalready exist in traditional media, these Guidelines are also\napplicable to textual material which is born\ndigital.  We believe them to be adequate to \nthe widest variety of currently existing practices in using\ndigital textual data, but by no means limited to them.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.15\">The rules and recommendations made in these Guidelines are\nexpressed in terms of what is currently the most widely-used markup\nlanguage for digital resources of all kinds: the Extensible Markup\nLanguage (XML), as defined by the World Wide Web Consortium's XML\nRecommendation. However, the TEI encoding scheme itself does not\ndepend on this language; it was originally formulated in terms of SGML\n(the ISO Standard Generalized Markup Language), a\npredecessor of XML, and\nmay in future years be re-expressed in other ways as the\nfield of markup develops and matures. For more information on markup\nlanguages see chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.15.2\" emit=\"transcription\" hash=\"SG\" xml-id=\"SG\">5 A Gentle Introduction to XML</pb-link>; for more\ninformation on the associated character encoding issues see chapter\n<pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.15.4\" emit=\"transcription\" hash=\"CH\" xml-id=\"CH\">6 Languages and Character Sets</pb-link>.\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.17\">This document provides the authoritative and complete statement of\nthe requirements and usage of the TEI encoding scheme.  As such,\nalthough it includes numerous small examples, it must be stressed that\nthis work is intended to be a reference manual rather than a tutorial\nguide. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.19\">The remainder of this chapter comprises three sections.  The first\ngives an overview of the structure and notational conventions used\nthroughout these Guidelines.  The second enumerates the design principles\nunderlying the TEI scheme and the application environments in which it\nmay be found useful.  Finally, the third section gives a brief account\nof the origins and development of the Text Encoding Initiative itself.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21\" id=\"ABSTRUNC\"><h2 class=\"tei-head9\" data-tei=\"1.7.2.13.21.3\">4.1 Structure and Notational\nConventions of this Document</h2>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.5\">The remaining two sections of the front matter to these Guidelines\nprovide background tutorial material for those unfamiliar with basic\nmarkup technologies. Following the present introductory section, we\npresent a detailed introduction to XML itself, intended to cover in a\nrelatively painless manner as much as the novice user of the TEI\nscheme needs to know about markup languages in general and XML in\nparticular. This is followed by a discussion of the general principles\nunderlying current practice in the representation of different\nlanguages and writing systems in digital form. This chapter is largely\nintended for the user unfamiliar with the Unicode encoding systems,\nthough the expert may also find its historical overview of\ninterest.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.7\">The body of this edition of these Guidelines proper contains 23\nchapters arranged in increasing order of specialist interest. The\nfirst five chapters discuss in depth matters likely to be of\nimportance to anyone intending to apply the TEI scheme to virtually\nany kind of text. The next seven focus on particular kinds of text:\nverse, drama, spoken text, dictionaries, and manuscript\nmaterials. The next nine chapters deal with a wide range of topics,\none or more of which are likely to be of interest in specialist\napplications of various kinds. The last two chapters deal with the XML\nencoding used to represent the TEI scheme itself, and provide\ntechnical information about its implementation. The last chapter also\ndefines the notion of TEI conformance and its implications for\ninterchange of materials produced according to these Guidelines.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.9\">As noted above, this is a reference work, and is not intended to be\nread through from beginning to end. However, the reader wishing to\nunderstand the full potential of the TEI scheme will need a thorough\ngrasp of the material covered by the first four chapters and the last\ntwo. Beyond that, the reader is recommended to select according to\ntheir specific interests: one of the strengths of the TEI architecture\nis its modular nature. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.11\">As far as possible, extensive cross referencing is provided\nwherever related topics are dealt with; these are particularly\neffective in the online version of these Guidelines. In addition, a\nseries of technical appendixes provide detailed formal definitions for\nevery element, every class, and every macro discussed in the body of\nthe work; these are also cross linked as appropriate. Finally, a\ndetailed bibliography is provided, which identifies the source of many\nexamples cited in the text as well as documenting works referred to,\nand listing other relevant publications.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.13\">As an aid to the reader, most chapters of these Guidelines follow\nthe same basic organization. The chapter begins with an overview of\nthe subjects treated within it, linked to the following\nsubsections. Within each section where new elements are described, a\nsummary table is first given, which provides their names and a brief\ndescription of their intended usage. This is then followed where\nappropriate by further discussion of each element, including wherever\npossible usage examples taken somewhat eclectically from a variety of\nreal sources. These examples are not intended to be exhaustive, but\nrather to suggest typical ways in which the elements concerned may\nusefully be applied. Where appropriate, a link to a statement of the\nsource for most examples is provided in the online version. Within the\nexamples, use of whitespace such as newlines or indentation is simply\nintended to aid legibility, and is not prescriptive or normative. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.15\">Wherever TEI elements or classes are mentioned in the text, they\nare linked in the online version to the relevant reference\nspecification for the element or class concerned. Element names are\nalways given in the form <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.15.2\" href=\"/ref/name\" target=\"\">name</a>, where <span class=\"tei-q2\" data-tei=\"1.7.2.13.21.15.4\">name</span> is the\n<span class=\"tei-term\" data-tei=\"1.7.2.13.21.15.6\">generic identifier</span> of the element; empty elements such as\n<a class=\"tei-gi\" data-tei=\"1.7.2.13.21.15.8\" href=\"/ref/pb\" target=\"\">pb</a> or <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.15.10\" href=\"/ref/anchor\" target=\"\">anchor</a> include a closing slash to distinguish\nthem wherever they are discussed. References to attributes take the\nform attname, where <span class=\"tei-q2\" data-tei=\"1.7.2.13.21.15.14\">attname</span> is the name of the\nattribute.  References to classes are also presented as links, for\nexample <span class=\"tei-ident1\" data-tei=\"1.7.2.13.21.15.16\"><a href=\"/ref/model.divLike\">model.divLike</a></span> for a model class,\nand <span class=\"tei-ident1\" data-tei=\"1.7.2.13.21.15.18\"><a href=\"/ref/att.global\">att.global</a></span> for an attribute class.\n</p>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.17\" id=\"AB-modal\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.2.13.21.17.3\">4.1.1 The use of modal verbs</h3>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.17.5\">In general the TEI guidelines try to be careful when using modal verbs and phrases such as 'must', 'must not, \n      'should', 'should not' and 'may'. In terms of the meanings, these generally follow <span class=\"tei-ptr4\" data-tei=\"1.7.2.13.21.17.5.2\"><a href=\"https://tools.ietf.org/html/bcp14\">https://tools.ietf.org/html/bcp14</a></span> in the different meanings of these words.\n      In particular:\n      <dl class=\"tei-list3\" data-tei=\"1.7.2.13.21.17.5.4\"><dt data-tei=\"1.7.2.13.21.17.5.4.5\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.17.5.4.3\">MUST</span></dt><dd data-tei=\"1.7.2.13.21.17.5.4.5\">This word, or the terms \"REQUIRED\" or \"SHALL\", means that this is an absolute requirement of the TEI Guidelines \n          for production of a TEI conformant file.</dd><dt data-tei=\"1.7.2.13.21.17.5.4.9\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.17.5.4.7\">MUST NOT</span></dt><dd data-tei=\"1.7.2.13.21.17.5.4.9\">This phrase, or the phrase \"SHALL NOT\", means that this is an absolute prohibition of the \n          TEI Guidelines for production of a TEI conformant file.</dd><dt data-tei=\"1.7.2.13.21.17.5.4.13\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.17.5.4.11\">SHOULD</span></dt><dd data-tei=\"1.7.2.13.21.17.5.4.13\">This word, or the adjective \"RECOMMENDED\", means that there may exist valid reasons in \n          particular circumstances to ignore a particular recommendation, but the full implications \n          must be understood and carefully weighed before choosing a different course.</dd><dt data-tei=\"1.7.2.13.21.17.5.4.17\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.17.5.4.15\">SHOULD NOT</span></dt><dd data-tei=\"1.7.2.13.21.17.5.4.17\">This phrase, or the phrase \"NOT RECOMMENDED\" means that there may exist valid reasons in \n          particular circumstances when the particular behavior is acceptable or even useful, but the full implications \n          should be understood and the case carefully weighed before implementing any behavior so described.</dd><dt data-tei=\"1.7.2.13.21.17.5.4.21\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.17.5.4.19\">MAY</span></dt><dd data-tei=\"1.7.2.13.21.17.5.4.21\">This word, or the adjective \"OPTIONAL\", means that a recommendation is truly optional.  One user may \n          choose to follow the recommendation because a particular project requires it or feels that\n          it enhances their work while another project may choose to not follow this recommendation.</dd></dl>\n      However, the prose of the TEI Guidelines continually undergoes revision and all uses may not reflect this. Please report \n      any errors or unclear use of these words.\n    </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.19\" id=\"AB-namecon\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.2.13.21.19.3\">4.1.2 TEI Naming Conventions</h3>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.19.5\">These Guidelines use a more or less consistent set of conventions\nin the naming of XML elements and classes. This section summarizes\nthose conventions.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.19.7\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.2.13.21.19.7.2\">4.1.2.1 Element and Attribute Names</h4>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.19.7.4\">An unadorned name such as <span class=\"tei-q2\" data-tei=\"1.7.2.13.21.19.7.4.2\">blort</span> is the\nname of a TEI element or attribute. <a class=\"note tei-note\" data-tei=\"1.7.2.13.21.19.7.4.4\" href=\"#fn_1_7_2_13_21_19_7_4_4\" id=\"fnref_1_7_2_13_21_19_7_4_4\" rel=\"footnote\">1</a>.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.19.7.6\">The following conventions apply to the choice of names:\n<ul class=\"tei-list3\" data-tei=\"1.7.2.13.21.19.7.6.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.19.7.6.2.2\">Elements are given generic identifiers as far as possible\nconsisting of one or more <span class=\"tei-term\" data-tei=\"1.7.2.13.21.19.7.6.2.2.2\">tokens</span>, by which we mean whole\nwords or recognisable abbreviations of them, taken from the English\nlanguage. </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.19.7.6.2.4\">Where an element name contains more than one token, the first\nletter of the second\ntoken, and of any subsequent ones, is capitalized, as in for example\n<a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.6.2.4.2\" href=\"/ref/biblStruct\" target=\"\">biblStruct</a>, <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.6.2.4.4\" href=\"/ref/listPerson\" target=\"\">listPerson</a>. This\ncamelCasing is used also for attribute names and\nsymbolic values. </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.19.7.6.2.6\">Module names also use whole words, for the most part, but are\nalways all lower case. </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.19.7.6.2.8\">The specification for an element or attribute whose name\ncontains abbreviations generally also includes a <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.6.2.8.2\" href=\"/ref/gloss\" target=\"\">gloss</a>\nelement providing the expanded sense of the name.</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.19.7.6.2.10\">An element specification may also contain approved translations\nfor element or attribute names in one or more other languages using\nthe <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.6.2.10.2\" href=\"/ref/altIdent\" target=\"\">altIdent</a> element; this is not however generally done in\nTEI P5.</li></ul>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.19.7.8\">Whole words are generally preferred for clarity. The following\nabbreviations are however commonly used within generic identifiers:\n<dl class=\"tei-list3\" data-tei=\"1.7.2.13.21.19.7.8.2\"><dt data-tei=\"1.7.2.13.21.19.7.8.2.4\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.2\">att</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.4\">attribute</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.8\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.6\">bibl</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.8\">bibliographic description or reference in a bibliography</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.12\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.10\">cat</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.12\">category, especially as used in text classification </dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.16\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.14\">char</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.16\">character, typically a Unicode character</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.20\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.18\">doc</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.20\">document: this usually refers to the original source document\nwhich is being encoded,</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.24\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.22\">decl</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.24\">declaration: has a specific sense in the TEI\nheader, as discussed in <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.19.7.8.2.24.2\" emit=\"transcription\" hash=\"HD12\" xml-id=\"HD12\">2.1.2 Types of Content in the TEI Header</pb-link></dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.28\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.26\">desc</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.28\">description: has a specific sense in the TEI header, as\ndiscussed in <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.19.7.8.2.28.2\" emit=\"transcription\" hash=\"HD12\" xml-id=\"HD12\">2.1.2 Types of Content in the TEI Header</pb-link> </dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.32\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.30\">grp</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.32\">group. In TEI usage, a group is distinguished from a list in that\nthe former associates several objects which act as a single entity,\nwhile the latter does not. For example, a <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.8.2.32.2\" href=\"/ref/linkGrp\" target=\"\">linkGrp</a> combines\nseveral <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.8.2.32.4\" href=\"/ref/link\" target=\"\">link</a> elements which have certain properties in\ncommon, whereas a <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.8.2.32.6\" href=\"/ref/listBibl\" target=\"\">listBibl</a> simply lists a number of otherwise\nunrelated <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.8.2.32.8\" href=\"/ref/bibl\" target=\"\">bibl</a> elements.</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.36\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.34\">interp</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.36\">interpretation or analysis</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.39\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.38\">lang</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.39\">(natural) language</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.42\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.41\">ms</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.42\">manuscript</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.46\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.44\">org</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.46\">organization, that is, a named group of people or legal entity</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.50\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.48\">rdg</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.50\">reading or version found in a specific witness</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.53\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.52\">ref</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.53\">reference or link</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.57\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.55\">spec</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.57\">technical specification or definition</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.61\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.59\">stmt</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.61\">statement: used in a specific sense in the TEI header,\nas discussed in <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.19.7.8.2.61.2\" emit=\"transcription\" hash=\"HD12\" xml-id=\"HD12\">2.1.2 Types of Content in the TEI Header</pb-link></dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.65\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.63\">struct</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.65\">structured: that is, containing a specific set of\nnamed elements rather than mixed content</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.69\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.67\">val</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.69\">value, for example of a variable or an attribute</dd><dt data-tei=\"1.7.2.13.21.19.7.8.2.73\"><span class=\"tei-label\" data-tei=\"1.7.2.13.21.19.7.8.2.71\">wit</span></dt><dd data-tei=\"1.7.2.13.21.19.7.8.2.73\">witness: that is, a specific document which attests specific\nreadings in a textual tradition or apparatus</dd></dl>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.19.7.10\">Some abbreviations are used inconsistently: for example,\n<a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.10.2\" href=\"/ref/add\" target=\"\">add</a> is an addition, and <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.10.4\" href=\"/ref/addSpan\" target=\"\">addSpan</a> is a spanning\naddition, but <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.10.6\" href=\"/ref/addName\" target=\"\">addName</a> is an additional name, not the name of\nan addition. Such inconsistencies are relatively few in number, and it\nis hoped to remove them in subsequent revisions of these Guidelines.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.19.7.12\">Some elements have very short abbreviated names: these are for the\nmost part elements which are likely to be used very frequently in a\nmarked up text, for example <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.12.2\" href=\"/ref/p\" target=\"\">p</a> (paragraph), <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.12.4\" href=\"/ref/s\" target=\"\">s</a>\n(segment) <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.12.6\" href=\"/ref/hi\" target=\"\">hi</a> (highlighted phrase), <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.12.8\" href=\"/ref/ptr\" target=\"\">ptr</a> (pointer),\n<a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.12.10\" href=\"/ref/div\" target=\"\">div</a> (division) etc. We do not specifically list such elements\nhere: as noted above, an expansion of each such abbreviated name is\nprovided within the documentation using the <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.19.7.12.12\" href=\"/ref/gloss\" target=\"\">gloss</a> element\n.</p>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.21\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.2.13.21.21.2\">4.1.3 Class, Macro, and Datatype Names</h3>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.21.4\">All named objects other than elements and attributes have one of\nthe following prefixes, which indicate whether the object is a module,\nan attribute class, a model class, a datatype, or a macro: <table class=\"tei-table\" data-tei=\"1.7.2.13.21.21.4.2\">\n<tr class=\"tei-row1\" data-tei=\"1.7.2.13.21.21.4.2.2\">\n<td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.2.3\">Component</td>\n<td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.2.5\">Name</td>\n<td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.2.7\">Example</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.2.13.21.21.4.2.4\"><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.4.1\">Attribute \nClasses</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.4.2\">att.*</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.4.3\">att.global</td></tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.2.13.21.21.4.2.6\"><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.6.1\">Model \nClasses</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.6.2\">model.*</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.6.3\">model.biblPart</td></tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.2.13.21.21.4.2.8\"><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.8.1\">Macros</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.8.2\">macro.*</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.8.3\">macro.paraContent</td></tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.2.13.21.21.4.2.10\"><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.10.1\">Datatypes</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.10.2\">teidata.*</td><td class=\"tei-cell\" data-tei=\"1.7.2.13.21.21.4.2.10.3\">teidata.pointer</td></tr>\n</table>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.21.6\">The concepts of model class, attribute class, etc. are defined in\n<pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.21.6.2\" emit=\"transcription\" hash=\"ST\" xml-id=\"ST\">1 The TEI Infrastructure</pb-link>.  Here we simply note some conventions about their\nnaming. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.21.8\">The following rules apply to attribute class names: <ul class=\"tei-list3\" data-tei=\"1.7.2.13.21.21.8.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.8.2.2\">Attribute class names take the form <span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.8.2.2.2\">att.xxx</span>, where\n<span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.8.2.2.4\">xxx</span> is typically an adjective, or a series of adjectives\nseparated by dots, describing a property common to the attributes\nwhich make up the class.</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.8.2.4\">Attributes with the same name are considered to have the same\nsemantics, whether the attribute is inherited from a class, or locally\ndefined.</li></ul>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.21.10\">The following rules apply to model class names: <ul class=\"tei-list3\" data-tei=\"1.7.2.13.21.21.10.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.10.2.2\">Model classes have names beginning <span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.10.2.2.2\">model.</span> followed\nby a <span class=\"tei-term\" data-tei=\"1.7.2.13.21.21.10.2.2.4\">root name</span>, and zero or more suffixes as described\nbelow.</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.10.2.4\">A root name may be the name of an element, generally the\nprototypical parent or sibling for elements which are members of the\nclass.</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.10.2.6\">The first suffix should be <span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.10.2.6.2\">Part</span>, if the class\nmembers are all children of the element named rootname; or\n<span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.10.2.6.4\">Like</span>, if the class members are all siblings of the\nelement named <span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.10.2.6.6\">rootname</span>. </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.10.2.8\">The rootname <span class=\"tei-code2 code\" data-tei=\"1.7.2.13.21.21.10.2.8.2\">global</span> is used to indicate that class\nmembers are permitted anywhere in a TEI document.</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.21.10.2.10\">Additional suffixes may be added, prefixed by a dot, to\ndistinguish subclasses, semantic or structural.</li></ul>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.21.12\">For example, the class of elements which can form part of a\n<a class=\"tei-gi\" data-tei=\"1.7.2.13.21.21.12.2\" href=\"/ref/div\" target=\"\">div</a> is called <span class=\"tei-ident1\" data-tei=\"1.7.2.13.21.21.12.4\"><a href=\"/ref/model.divPart\">model.divPart</a></span>. This class\nincludes as a subclass the elements which can form part of a\n<a class=\"tei-gi\" data-tei=\"1.7.2.13.21.21.12.6\" href=\"/ref/div\" target=\"\">div</a> in a spoken text, which is named\n<span class=\"tei-ident1\" data-tei=\"1.7.2.13.21.21.12.8\"><a href=\"/ref/model.divPart.spoken\">model.divPart.spoken</a></span></p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.23\" id=\"ABTEI2\"><h3 class=\"tei-head9\" data-tei=\"1.7.2.13.21.23.3\">4.1.4 Design Principles</h3>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.5\">Because of its roots in the humanities research community, the TEI\nscheme is driven by its original goal of serving the needs of research,\nand is therefore committed to providing a maximum of comprehensibility,\nflexibility, and extensibility.  More specific design goals of the TEI\nhave been that these Guidelines should:\n<ul class=\"tei-list3 simple\" data-tei=\"1.7.2.13.21.23.5.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.2.3\">provide a standard format for data interchange</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.2.5\">provide guidance for the encoding of texts in this format</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.2.7\">support the encoding of all kinds of features of all\nkinds of texts studied by researchers</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.2.9\">be application independent</li></ul>\nThis has led to a number of important design decisions, such as:\n<ul class=\"tei-list3 simple\" data-tei=\"1.7.2.13.21.23.5.4\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.4.3\">the choice of XML and Unicode</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.4.5\">the provision of a large predefined tag set</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.4.7\">encodings for different views of text</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.4.9\">alternative encodings for the same textual features</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.23.5.4.11\">mechanisms for user-defined modification of the scheme</li></ul>\nWe discuss some of these goals in more detail below.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.7\">The goal of creating a common interchange format which is\napplication independent requires the definition of a specific markup\nsyntax as well as the definition of a large set of elements or\nconcepts.  The syntax of the recommendations made in this document\nconforms to the World Wide Web Consortium's XML Recommendation (<pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.23.7.2\" emit=\"transcription\" hash=\"XMLREC\" xml-id=\"XMLREC\">1 </pb-link>)\nbut their definition is as far\nas possible independent of any particular schema language. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.9\">The goal of providing guidance for text encoding suggests that\nrecommendations be made as to what textual features should be recorded\nin various situations. However, when selecting certain features for\nencoding in preference to others, these Guidelines have tended to\nprefer generic solutions to specific ones, and to avoid areas where no\nconsensus exists, while attempting to accommodate as many diverse views\nas feasible.  Consequently, the TEI Guidelines make (with relatively\nrare exceptions) no suggestions or restrictions as to the relative\nimportance of textual features.  The philosophy of these Guidelines is\n<span class=\"tei-q2\" data-tei=\"1.7.2.13.21.23.9.2\">if you want to encode this feature, do it this way</span>—but very\nfew features are mandatory. In the same spirit, while these Guidelines\nvery rarely require you to encode any particular feature, they do\nrequire you to be honest about which features you have encoded, that\nis, to respect the meanings and usage rules they recommend for\nspecific elements and attributes proposed. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.11\">The requirement to support all kinds of materials likely to be of\ninterest in research has largely conditioned the development of the\nTEI into a very flexible and modular system. The development of other\nXML vocabularies or standards is typically motivated by the desire to\ncreate a single fully specified encoding scheme for use in a\nwell-defined application domain. By contrast, the TEI is intended for\nuse in a large number of rather ill-defined and often overlapping\ndomains. It achieves its generality by means of the modular\narchitecture described in <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.23.11.2\" emit=\"transcription\" hash=\"ST\" xml-id=\"ST\">1 The TEI Infrastructure</pb-link> which enables each user\nto create a schema appropriate to their needs without compromising the\ninteroperability of their data.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.13\">The Guidelines have been written largely with a focus on text capture\n(i.e. the representation in electronic form of an already existing copy\ntext in another medium) rather than text creation (where no such copy\ntext exists).  Hence the frequent use of terms like\ntranscription, original,\ncopy text, etc.  However, these Guidelines are\nequally applicable to text creation, although certain elements, such as <a class=\"tei-gi\" data-tei=\"1.7.2.13.21.23.13.8\" href=\"/ref/sourceDesc\" target=\"\">sourceDesc</a>, and certain attributes, such as <a class=\"tei-ref3\" data-tei=\"1.7.2.13.21.23.13.10\" href=\"#STGAre\" target=\"\">the rendition indicators</a>, will not be relevant in this case. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.15\">Concerning text capture the TEI Guidelines do not specify a\nparticular approach to the problem of fidelity to the source text and\nrecoverability of the original; such a choice is the responsibility of\nthe text encoder.  The current version of these Guidelines, however,\nprovides a more fully elaborated set of tags for markup of rhetorical,\nlinguistic, and simple typographic characteristics of the text than for\ndetailed markup of page layout or for fine distinctions among type fonts\nor manuscript hands. It should be noted also that, with the present\nversion of these Guidelines, it is no longer necessarily the case that\nan unmediated version of the source text can be recovered from an\nencoded text simply by removing the markup.\n\t</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.17\">In these Guidelines, no hard and fast distinction is drawn between\nobjective and subjective\ninformation or between representation and\ninterpretation.  These distinctions, though\nwidely made and often useful in narrow, well-defined contexts, are\nperhaps best interpreted as distinctions between issues on which there\nis a scholarly consensus and issues where no such consensus exists.\nSuch consensus has been, and no doubt will be, subject to change.  The\nTEI Guidelines do not make suggestions or restrictions as to which of\nthese features should be encoded.  The use of the terms\n<span class=\"tei-term\" data-tei=\"1.7.2.13.21.23.17.10\">descriptive</span> and <span class=\"tei-term\" data-tei=\"1.7.2.13.21.23.17.12\">interpretive</span> about different\ntypes of encoding in these Guidelines is not intended to support any\nparticular view on these theoretical issues. Historically, it reflects\na purely practical division of responsibility amongst the original\nworking committees (see further <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.23.17.14\" emit=\"transcription\" hash=\"ABTEI\" xml-id=\"ABTEI\">4.2 Historical Background</pb-link>).  </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.19\">In general, the accuracy and the reliability of the encoding and the\nappropriateness of the interpretation is for the individual user of the\ntext to determine.  The Guidelines provide a means of documenting the\nencoding in such a way that a user of the text can know the reasoning\nbehind that encoding, and the general interpretive decisions on which it\nis based.  The TEI header should be used to document and justify many\nsuch aspects of the encoding, but the choice of TEI elements for a\nparticular feature is in itself a statement about the interpretation\nreached by the encoder.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.21\">In many situations more than one view of a text is needed since no\nabsolute recommendation to embody one specific view of text can apply\nto all texts and all approaches to them.  Within limits, the syntax of\nXML ensures that some encodings can be ignored for some purposes.  To\nenable encoding multiple views, these Guidelines not only treat a\nvariety of textual features, but sometimes provide several alternative\nencodings for what appear to be identical textual phenomena.  These\nGuidelines offer the possibility of encoding many different\nviews of the text, simultaneously if necessary. Where different views\nof the formal structure of a text are required, as opposed to\ndifferent annotations on a single structural view, however, the formal\nsyntax of XML (which requires a single hierarchical view of text\nstructure) poses some problems; recommendations concerning ways of\novercoming or circumventing that restriction are discussed in chapter\n<pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.23.21.2\" emit=\"transcription\" hash=\"NH\" xml-id=\"NH\">20 Non-hierarchical Structures</pb-link>. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.23.23\">In brief, the TEI Guidelines define a general-purpose encoding\nscheme which makes it possible to encode different views of text,\npossibly intended for different applications, serving the majority of\nscholarly purposes of text studies in the humanities.  Because no\npredefined encoding scheme can possibly serve all research purposes,\nthe TEI scheme is designed to facilitate both selection from a wide\nrange of predefined markup choices, and the addition of new (non-TEI)\nmarkup options. By providing a formally verifiable means of extending\nthe TEI recommendations, the TEI makes it simple for such\nuser-identified modifications to be incorporated into future releases\nof these Guidelines as they evolve. The underlying mechanisms which\nsupport these aspects of the scheme are introduced in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.23.23.2\" emit=\"transcription\" hash=\"ST\" xml-id=\"ST\">1 The TEI Infrastructure</pb-link>, and detailed discussions of their use provided in\nchapter <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.23.23.4\" emit=\"transcription\" hash=\"USE\" xml-id=\"USE\">23 Using the TEI</pb-link>. </p></div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.25\" id=\"ABAPP\"><h3 class=\"tei-head9\" data-tei=\"1.7.2.13.21.25.3\">4.1.5 Intended Use</h3>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.5\">We envisage three primary functions for these Guidelines:\n<ul class=\"tei-list3 simple\" data-tei=\"1.7.2.13.21.25.5.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.5.2.3\">guidance for individual or local practice in text\ncreation and data capture;</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.5.2.5\">support of data interchange;</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.5.2.7\">support of application-independent local processing.</li></ul>\nThese three functions are so thoroughly interwoven in practice that it\nis hardly possible to address any one without addressing the others.\nHowever, the distinction provides a useful framework for discussing the\npossible role of these Guidelines in work with electronic texts.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.25.7\" id=\"ABAPP1\"><h4 class=\"tei-head9\" data-tei=\"1.7.2.13.21.25.7.3\">4.1.5.1 Use in Text Capture and Text Creation</h4>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.7.5\">The description of textual features found in the chapters which\nfollow should provide a useful checklist from which scholars planning to\ncreate electronic texts should select the subset of features suitable\nfor their project.  </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.7.7\">Problems specific to text creation or text\ncapture have not been considered explicitly in\nthis document.  These Guidelines are not concerned with the process by\nwhich a digital text comes into being: it can be typed by hand,\nscanned from a printed book or typescript, read from a typesetter's\ntape, or acquired from another researcher who may have used another\nmarkup scheme (or no explicit markup at all).</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.7.9\">We include here only some general points which are often raised about\nmarkup and the process of data capture.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.7.11\">XML can appear distressingly verbose, particularly when (as in these\nGuidelines) the names of tags and attributes are chosen for clarity and\nnot for brevity.  Editor macros and keyboard shortcuts can allow a\ntypist to enter frequently used tags with single keystrokes.\nIt is often possible to transform word-processed or\nscanned text automatically.  Markup-aware software can help with\nmaintaining the hierarchical structure of the document, and display the\ndocument with visual formatting rather than raw tags.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.7.13\">The techniques described in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.25.7.13.2\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>\nmay be used to develop simpler data capture TEI-conformant schemas,\nfor example with limited numbers of elements, or with shorter names\nfor the tags being used most often.  Documents created with such\nschemas may then be automatically converted to a more elaborated TEI\nform. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.25.9\" id=\"ABAPP2\"><h4 class=\"tei-head9\" data-tei=\"1.7.2.13.21.25.9.3\">4.1.5.2 Use for Interchange</h4>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.9.5\">The TEI format may simply be used as an interchange format,\npermitting projects to share resources even when their local encoding\nschemes differ. If there are <span class=\"tei-formula2\" data-tei=\"1.7.2.13.21.25.9.5.2\">n</span> different encoding\nformats, to provide mappings between each possible pair of formats\nrequires <span class=\"tei-formula2\" data-tei=\"1.7.2.13.21.25.9.5.4\">n×(n-1)</span> translations; with an\ninterchange format, only <span class=\"tei-formula2\" data-tei=\"1.7.2.13.21.25.9.5.6\">2×n</span> such mappings\nare needed. However, for such translations to be carried out without\nloss of information, the interchange format chosen must be as\nexpressive (in a formal sense) as any of the target formats; this is a\nfurther reason for the TEI's provision of both highly abstract or\ngeneric encodings and highly specific ones.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.9.7\">To translate between any pair of encoding schemes implies:\n<ul class=\"tei-list3 ordered\" data-tei=\"1.7.2.13.21.25.9.7.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.7.2.3\">identifying the sets of textual features distinguished\nby the two schemes;</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.7.2.5\">determining where the two sets of features correspond;</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.7.2.7\">creating a suitable set of mappings.</li></ul> </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.9.9\">For example, to translate from encoding scheme X into the TEI\nscheme:\n<ul class=\"tei-list3 ordered\" data-tei=\"1.7.2.13.21.25.9.9.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.9.2.3\">Make a list of all the textual features distinguished in\nX. </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.9.2.5\">Identify the corresponding feature in the TEI scheme.\nThere are three possibilities for each feature:\n<ul class=\"tei-list3 ordered\" data-tei=\"1.7.2.13.21.25.9.9.2.5.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.9.2.5.2.3\">the feature exists in both X and the TEI scheme;</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.9.2.5.2.5\">X has a feature which is absent from the TEI scheme;</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.9.2.5.2.7\">X has a feature which corresponds with more than one\nfeature in the TEI scheme.</li></ul>\nThe first case is a trivial renaming.  The second will require an extension to\nthe TEI scheme, as described in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.25.9.9.2.5.4\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>.  The third\nis more problematic, but not impossible, provided that a consistent\nchoice can be made (and documented) amongst the alternatives.  </li></ul></p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.9.11\">The ease with which this translation can be defined will of\ncourse depend on the clarity with which scheme X\nrepresents the features it encodes.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.9.13\">Translating from the TEI into scheme X follows the same pattern,\nexcept that if a TEI feature has no equivalent in X, and X cannot be\nextended, information must be lost in translation.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.9.15\">The rules defining conformance to these Guidelines are\ngiven in some detail in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.21.25.9.15.2\" emit=\"transcription\" hash=\"CF\" xml-id=\"CF\">23.4 Conformance</pb-link>.\nThe basic principles informing those rules may be summarized as\nfollows:\n<ul class=\"tei-list3 ordered\" data-tei=\"1.7.2.13.21.25.9.15.4\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.15.4.3\">The TEI <span class=\"tei-term\" data-tei=\"1.7.2.13.21.25.9.15.4.3.2\">abstract model</span> (that is, the set of\ncategorical distinctions which it defines in the prose of the Guidelines) must be respected. The\ncorrespondence between a tag X and the semantic function assigned to\nit by these Guidelines may not be changed; such changes are known\nas <span class=\"tei-term\" data-tei=\"1.7.2.13.21.25.9.15.4.3.4\">tag abuse</span> and strongly discouraged.</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.15.4.5\">A TEI document must be expressed as a valid XML-conformant\ndocument which uses the TEI namespace appropriately. If, for example,\nthe document encodes features not provided by these Guidelines, such\nextensions should not be associated with the TEI namespace.  </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.9.15.4.7\">It must be possible to validate a TEI document against a schema\nderived from these Guidelines, possibly with extensions provided in\nthe recommended manner.</li></ul>\n</p></div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.21.25.11\" id=\"ABAPP3\"><h4 class=\"tei-head9\" data-tei=\"1.7.2.13.21.25.11.3\">4.1.5.3 Use for Local Processing</h4>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.11.5\">Machine-readable text can be manipulated in many ways; some users:\n<ul class=\"tei-list3 simple\" data-tei=\"1.7.2.13.21.25.11.5.2\"><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.3\">edit texts (e.g. word processors, syntax-directed\neditors) </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.5\">edit, display, and link texts in hypertext systems</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.7\">format and print texts using desktop publishing systems,\nor batch-oriented formatting programs </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.9\">load texts into free-text retrieval databases or\nconventional databases </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.11\">unload texts from databases as search results or for\nexport to other software </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.13\">search texts for words or phrases </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.15\">perform content analysis on texts </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.17\">collate texts for critical editions </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.19\">scan texts for automatic indexing or similar purposes</li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.21\">parse texts linguistically </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.23\">analyze texts stylistically </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.25\">scan verse texts metrically </li><li class=\"tei-item\" data-tei=\"1.7.2.13.21.25.11.5.2.27\">link text and images </li></ul> </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.11.7\">These applications cover a wide range of likely uses but are by no\nmeans exhaustive.  The aim has been to make the TEI Guidelines useful\nfor encoding the same texts for different purposes.  We have avoided\nanything which would restrict the use of the text for other\napplications.  We have also tried not to omit anything essential to any\nsingle application.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.21.25.11.9\">Because the TEI format is expressed using XML, \nalmost any modern text processing system is able to process it, and\nnew TEI-aware software systems are able to build on a solid base\nof existing software libraries. </p> </div></div></div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.23\" id=\"ABTEI\"><h2 class=\"tei-head9\" data-tei=\"1.7.2.13.23.3\">4.2 Historical Background</h2>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.5\">The Text Encoding Initiative grew out of a planning conference\nsponsored by the Association for Computers and the Humanities (ACH) and\nfunded by the U.S.  National Endowment for the Humanities (NEH), which\nwas held at Vassar College in November 1987.  At this conference some\nthirty representatives of text archives, scholarly societies, and\nresearch projects met to discuss the feasibility of a standard encoding\nscheme and to make recommendations for its scope, structure, content,\nand drafting.  During the conference, the Association for Computational\nLinguistics and the Association for Literary and Linguistic Computing\nagreed to join ACH as sponsors of a project to develop these Guidelines.\nThe outcome of the conference was a set of principles (the\nPoughkeepsie Principles, <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.23.5.4\" emit=\"transcription\" hash=\"AB-eg-01\" xml-id=\"AB-eg-01\">1 </pb-link>), which\ndetermined the further course of the project.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.11\">The Text Encoding Initiative project began in June 1988 with funding\nfrom the NEH, soon followed by further funding from the Commission of\nthe European Communities, the Andrew W. Mellon Foundation, and the\nSocial Science and Humanities Research Council of Canada.  Four working\ncommittees, composed of distinguished scholars and researchers from both\nEurope and North America, were named to deal with problems of text\ndocumentation, \ntext representation, text analysis and interpretation,  and\nmetalanguage and syntax issues.  Each committee was charged with the task of identifying\nsignificant particularities in a range of texts,\nand two editors appointed to harmonize the resulting recommendations. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.13\">A first draft version (P1, with the <span class=\"tei-q2\" data-tei=\"1.7.2.13.23.13.2\">P</span> here and subsequently\nstanding for <span class=\"tei-q2\" data-tei=\"1.7.2.13.23.13.4\">Proposal</span>) of the Guidelines was distributed in July\n1990 under the title <span class=\"tei-title5\" data-tei=\"1.7.2.13.23.13.6\">Guidelines for the Encoding and Interchange\nof Machine-Readable Texts</span>. \nExtensive public comment and further work on areas not covered in\nthis version resulted in the drafting of a revised version, TEI P2,\ndistribution of which began in April 1992.  This version included\nsubstantial amounts of new material, resulting from work carried out by\nseveral specialist working groups, set up in 1990 and 1991 to propose\nextensions and revisions to the text of P1.  The overall organization,\nboth of the draft itself and of the scheme it describes, was entirely\nrevised and reorganized in response to public comment on the first\ndraft.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.15\">In June 1993 an Advisory Board met to review the current state of\nthe TEI Guidelines, and recommended the formal publication of the work\ndone to that time.  That version of the TEI Guidelines, TEI P3,\nconsolidated the work published as parts of TEI P2, along with some\nadditional new material and was finally published in May of 1994\nwithout the label <span class=\"tei-mentioned\" data-tei=\"1.7.2.13.23.15.2\">draft</span>, thus marking the\nconclusion of the initial development work.\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.17\">In February of 1998 the World Wide Web Consortium issued a final\nRecommendation for the Extensible Markup Language, XML.<a class=\"note tei-note\" data-tei=\"1.7.2.13.23.17.2\" href=\"#fn_1_7_2_13_23_17_2\" id=\"fnref_1_7_2_13_23_17_2\" rel=\"footnote\">2</a>\nFollowing the rapid take-up of this new standard metalanguage, it\nbecame evident that the TEI Guidelines (which had been published\noriginally as an SGML application) needed to be re-expressed in this\nnew formalism if they were to survive. The TEI editors, with\nabundant assistance from others who had developed and used TEI,\ndeveloped an update plan, and made tentative decisions on relevant\nsyntactic issues. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.19\">In January of 1999, the University of Virginia and the University\nof Bergen formally proposed the creation of an international\nmembership organization, to be known as the TEI Consortium, which\nwould maintain, develop, and promote the TEI. Shortly thereafter, two\nfurther institutions with longstanding ties to the TEI (Brown\nUniversity and Oxford University) joined them in formulating an\nAgreement to Establish a Consortium for the Maintenance of the Text\nEncoding Initiative (<pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.23.19.2\" emit=\"transcription\" hash=\"AB-eg-02\" xml-id=\"AB-eg-02\">1 </pb-link>), on which basis the TEI\nConsortium was eventually established and incorporated as a\nnot-for-profit legal entity at the end of the year 2000. The first\nmembers of the new TEI Board took office during January of 2001. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.21\">The TEI Consortium was established in order to maintain a permanent\nhome for the TEI as a democratically constituted, academically and\neconomically independent, self-sustaining, non-profit organization. In\naddition, the TEI Consortium was intended to foster a broad-based user\ncommunity with sustained involvement in the future development and\nwidespread use of the TEI Guidelines (<pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.23.21.2\" emit=\"transcription\" hash=\"AB-eg-03\" xml-id=\"AB-eg-03\">1 </pb-link>). </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.23\">To oversee and manage the revision process in collaboration with\nthe TEI Editors, the TEI Board formed a Technical Council, with a\nmembership elected from the TEI user community. The Council met for\nthe first time in January 2002 at King's College London. Its first\ntask was to oversee production of an XML version\nof the TEI Guidelines, updating P3 to enable users to\nwork with the emerging XML toolset. This, the P4 version of the Guidelines,\nwas published in June 2002. It was essentially an XML version of P3,\nmaking no substantive changes to the constraints expressed in the\nschemas apart from those necessitated by the shift to XML, and\nchanging only corrigible errors identified in the prose of the P3\nGuidelines. However, given that P3 had by this time been in steady use\nsince 1994, it was clear that a substantial revision of its content\nwas necessary, and work began immediately on the P5 version of the\nGuidelines. This was planned as a thorough overhaul, involving a\npublic call for features and new development in a number of important\nareas not previously addressed including character encoding, graphics,\nmanuscript description, biographical and geographical data, and the\nencoding language in which the TEI Guidelines themselves are written. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.25\">The members of the TEI Council and its associated workgroups are\nlisted in <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.23.25.2\" emit=\"transcription\" hash=\"FM1\" xml-id=\"FM1\">3 Preface and Acknowledgments</pb-link>. In preparing this edition, they have\nbeen attentive to the requirements and practice of the widest possible\nrange of TEI users, who are now to be found in many different research\ncommunities across the world, and have been largely instrumental in\ntransforming the TEI from a grant-supported international research\nproject into a self-sustaining community-based effort. One effect\nof the incorporation of the TEI has been the legal requirement to hold\nan annual meeting of the Consortium members; these meetings have\nemerged as an invaluable opportunity to sustain and reinforce that\nsense of community. </p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.23.27\">The present\nwork is therefore the result of a sustained period of consultation,\ndrafting, and revision, with input from many different\nexperts. Whatever merits it may have are to be attributed to them; the\nEditors accept responsibility only for the errors remaining. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.2.13.25\" id=\"ABTEI4\"><h2 class=\"tei-head9\" data-tei=\"1.7.2.13.25.3\">4.3 Future Developments and Version Numbers</h2>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.25.5\">The encoding recommended by this document may be used without fear\nthat future versions of the TEI scheme will be inconsistent with it in\nfundamental ways.  The TEI will be sensitive, in revising these\nGuidelines, to the possible problems which revision might pose for those\nwho are already using this version of these Guidelines.  \n</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.25.7\">With TEI P5, a version numbering system is introduced following \n  <a class=\"tei-ref3\" data-tei=\"1.7.2.13.25.7.2\" href=\"http://unicode.org/versions/\" target=\"\">the pattern specified by \n    the Unicode Consortium</a>: the first digit identifies a major \n  version number, the second digit a minor version number, and the \n  third digit a sub-minor version number. The TEI undertakes that no \n  change will be made to the formal expression of these Guidelines \n  (that is, a TEI schema, as defined in <pb-link class=\"inner-ref\" data-tei=\"1.7.2.13.25.7.4\" emit=\"transcription\" hash=\"CF\" xml-id=\"CF\">23.4 Conformance</pb-link>) such that \n  documents conformant to a\ngiven major numbered release cease to be compatible with a subsequent\nrelease of the same major number. Moreover, as far as possible, new\nminor releases will be made only for the purpose of adding new\ncompatible features, or of correcting errors in existing features.</p>\n<p class=\"tei-p\" data-tei=\"1.7.2.13.25.9\">The Guidelines are currently maintained as an open source project\n  on the Github site <span class=\"tei-ptr4\" data-tei=\"1.7.2.13.25.9.2\"><a href=\"https://github.com/TEIC/TEI\">https://github.com/TEIC/TEI</a></span>, from which released\n  and development versions may be freely downloaded. See <a class=\"tei-ref3\" data-tei=\"1.7.2.13.25.9.4\" href=\"http://www.tei-c.org/Guidelines/P5/#previous\" target=\"\">Previous Releases of P5</a> for\n  information on how to find specific versions of TEI releases (Guidelines,\n  schemas etc.). Notice of errors detected and enhancements requested may \n  be submitted at <span class=\"tei-ptr4\" data-tei=\"1.7.2.13.25.9.6\"><a href=\"https://github.com/TEIC/TEI/issues\">https://github.com/TEIC/TEI/issues</a></span>.</p>\n</div></section><div class=\"popovers\"></div></div>", "footnotes": "<!DOCTYPE html>\n<div class=\"footnotes\"><dl class=\"footnote\" id=\"fn_1_7_2_13_21_19_7_4_4\"><dt class=\"fn-number\">1</dt><dd data-tei=\"1.7.2.13.21.19.7.4.4\" class=\"fn-content\">During\ngeneration of TEI RELAX NG schema fragments, the patterns corresponding\nwith these TEI names are given a prefix <span data-tei=\"1.7.2.13.21.19.7.4.4.3\" class=\"tei-code2 code\">tei</span> to allow them\nto co-exist with names from other XML namespace. This prefix is not\nvisible to the end user, and is not used in TEI documentation. When\ngenerating multi-namespace schemas, however, the user needs to be\naware of them. <a class=\"fn-back\" href=\"#fnref_1_7_2_13_21_19_7_4_4\">↩</a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_2_13_23_17_2\"><dt class=\"fn-number\">2</dt><dd data-tei=\"1.7.2.13.23.17.2\" class=\"fn-content\">XML was originally developed as a way of publishing on\nthe World Wide Web richly encoded documents such as those for which\nthe TEI was designed.  Several TEI participants contributed heavily to\nthe development of XML, most notably XML's senior co-editor\nC. M. Sperberg-McQueen, who served as the North American editor for\nthe TEI Guidelines from their inception until 1999. <a class=\"fn-back\" href=\"#fnref_1_7_2_13_23_17_2\">↩</a></dd></dl></div>", "userParams": {"track-ids": "True", "webcomponents": 7, "lng": "en"}, "collection": ""}