{"format": "json", "view": "div", "doc": "p5.xml", "root": "1.7.4.46", "id": "USE", "odd": "tei.odd", "next": "1.7.6.2", "previous": "1.7.4.44", "nextId": "REF-CLASSES-MODEL", "previousId": "TD", "switchView": null, "content": "<!DOCTYPE html>\n\n<div class=\"content\"><section class=\"tei-div9\" data-tei=\"1.7.4.46\" id=\"USE\">\n<h1 class=\"tei-head9\" data-tei=\"1.7.4.46.4\">23 Using the TEI</h1>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.6\">This section discusses some technical topics concerning the deployment of the TEI markup schema\n    documented elsewhere in these Guidelines.\n    \n    In section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.6.4\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link> we discuss the scope and variety of the TEI customization\n    mechanisms.\n    In <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.6.8\" emit=\"transcription\" hash=\"CF\" xml-id=\"CF\">23.4 Conformance</pb-link> we define the notions of <span class=\"tei-term\" data-tei=\"1.7.4.46.6.10\">TEI Conformance</span> and\n      <span class=\"tei-term\" data-tei=\"1.7.4.46.6.13\">TEI\n      Extension</span>. Since the ODD markup description language defined in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.6.15\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link> is fundamental to the way conformance and customization are handled in the TEI\n    system, these two definitional sections are followed by a section (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.6.17\" emit=\"transcription\" hash=\"IM\" xml-id=\"IM\">23.5 Implementation of an ODD System</pb-link>) which\n    describes the intended behaviour of an ODD processor. </p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.12\" id=\"MEDIATYPE\">\n<h2 class=\"tei-head9\" data-tei=\"1.7.4.46.12.4\">23.1 Serving TEI files with the TEI Media Type</h2>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.12.6\">In February 2011, the media type <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.12.6.2\">application/tei+xml</span> was registered with IANA\n      for <span class=\"tei-q2\" data-tei=\"1.7.4.46.12.6.4\">markup languages defined in accordance with the Text Encoding and Interchange\n        guidelines</span> (<a class=\"tei-ref3\" data-tei=\"1.7.4.46.12.6.6\" href=\"https://www.rfc-editor.org/info/rfc6129\" target=\"\">RFC 6129</a>). We\n      recommend that any XML file whose root element is in the TEI namespace be served with the\n      media type <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.12.6.8\">application/tei+xml</span> to enable and encourage automated recognition and\n      processing of TEI files by external applications.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.14\" id=\"DT\">\n<h2 class=\"tei-head9\" data-tei=\"1.7.4.46.14.5\">23.2 Obtaining the TEI</h2>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.14.7\">As discussed in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.14.7.2\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>, all components of the TEI schema are generated\n      from a single set of TEI XML source files. Schemas can be generated in each of XML DTD\n      language, W3C schema language, and RELAX NG schema language. Documentation can be generated in\n      a variety of commonly-used document formats, including HTML, DOCX, or PDF.\n      </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.14.9\">TEI components are freely available over the Internet and elsewhere. The canonical home for\n      the TEI source, the schema fragments generated from it, and example modifications, is the TEI\n      repository at <span class=\"tei-ptr4\" data-tei=\"1.7.4.46.14.9.2\"><a href=\"https://github.com/TEIC/TEI\">https://github.com/TEIC/TEI</a></span>; versions are also available in\n      other formats, along with copies of these Guidelines and related materials, from the TEI web\n      site at <span class=\"tei-ptr4\" data-tei=\"1.7.4.46.14.9.4\"><a href=\"http://www.tei-c.org/\">http://www.tei-c.org/</a></span>.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16\" id=\"MD\">\n<h2 class=\"tei-head9\" data-tei=\"1.7.4.46.16.4\">23.3 Customization</h2>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.6\">These Guidelines provide an encoding schema suitable for encoding a very wide range of texts,\n      and capable of supporting a wide variety of applications. For this reason, the TEI schema\n      supports a variety of different approaches to solving similar problems, and also defines a\n      much richer set of elements than is likely to be necessary in any given project. Furthermore,\n      the TEI schema may be extended in well-defined and documented ways for texts that cannot be\n      conveniently or appropriately encoded using what is provided. For these reasons, it is almost\n      impossible to use the TEI schema without customizing it in some way. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.8\">This section describes how the TEI encoding schema may be customized, and should be read in\n      conjunction with chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.8.2\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>, which describes how a specific application of\n      the TEI encoding schema should be documented. The documentation system described in that\n      chapter is, like the rest of the TEI schema, independent of any particular schema or document\n      type definition language. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.10\">Formally speaking, these Guidelines provide both syntactic rules about how elements and\n      attributes may be used in valid documents and semantic recommendations about what\n      interpretation should be attached to a given syntactic construct. In this sense, they provide\n      both a <span class=\"tei-term\" data-tei=\"1.7.4.46.16.10.2\">document type definition</span> and a <span class=\"tei-term\" data-tei=\"1.7.4.46.16.10.4\">document type declaration</span>.\n      More exactly, we may distinguish between the <span class=\"tei-term\" data-tei=\"1.7.4.46.16.10.6\">TEI Abstract Model</span>, which defines a\n      set of related concepts, and the <span class=\"tei-term\" data-tei=\"1.7.4.46.16.10.8\">TEI schema</span> which defines a set of syntactic\n      rules and constraints. Many (though not all) of the semantic recommendations are provided\n      solely as informal descriptive prose, though some of them are also enforced by means of such\n      constructs as datatypes (see <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.10.10\" emit=\"transcription\" hash=\"DTYPES\" xml-id=\"DTYPES\">1.4.2 Datatype Specifications</pb-link>), or by schema constraints expressed\n      using the Schematron language. Schematron constraints provide information about special kinds\n      of validation errors dependent on conditional relationships, such as the invalidity of an\n      attribute name or value on one element when another is present, or when, given a pair of\n      attributes such as minOccurs and maxOccurs, the minimum value exceeds\n      the maximum value. Schematron constraints also provide warnings when a particular element,\n      attribute, or combination is to be deprecated in future releases of the TEI scheme, to alert\n      users that the feature in question is no longer to be used after a certain date. Very rarely,\n      TEI Schematron constraints offer warnings that do not explicitly break with the TEI but\n      suggest a more efficient or less ambiguous encoding.\n      \n      Although the descriptions, validation errors, and warnings have been written with care, there\n      will inevitably be cases where the intention of the contributors has not been conveyed with\n      sufficient clarity to prevent users of these Guidelines from extending\n      them in the sense of attaching slightly variant semantics to them. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.12\">Beyond this unintentional semantic extension, some of the elements described can\n      intentionally be used in a variety of ways; for example, the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.12.2\" href=\"/ref/note\" target=\"\">note</a> has an\n      attribute type which can take on arbitrary string values, depending on how it is\n      used in a document. A new type of <span class=\"tei-q2\" data-tei=\"1.7.4.46.16.12.6\">note</span>, therefore, requires no change in the existing\n      model. On the other hand, for many applications, it may be desirable to constrain the possible\n      values for the type attribute to a small set of possibilities. A schema modified in\n      this way would no longer necessarily regard as valid the same set of documents as the\n      corresponding unmodified TEI schema, but would remain faithful to the same conceptual\n      model.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.14\">This section explains how the TEI schema can be customized by suppressing elements, modifying\n      classes of elements, or adding elements. Documents which\n      validate against an application of the TEI schema which has been customized in this way may or\n      may not be considered TEI-conformant, as further discussed in section\n        <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.14.6\" emit=\"transcription\" hash=\"CF\" xml-id=\"CF\">23.4 Conformance</pb-link>.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.16\">The TEI system is designed to support modification and customization in a documented way that\n      can be validated by an XML processor. This is achieved by writing a small TEI-conformant\n      document, known informally as an ODD (One Document Does it all), from which an appropriate\n      processor can generate both human-readable documentation, and a schema expressed in a language\n      such as RELAX NG or DTD. The mechanisms used to instantiate a TEI schema differ for different\n      schema languages, and are therefore not defined here. In XML DTDs, for example, extensive use\n      is made of parameter entities, while in RELAX NG schemas, extensive use is made of patterns.\n      In either case, the names of elements and, wherever possible, their attributes and content\n      models are defined indirectly. The syntax used to implement this indirection also varies with\n      the schema language used, but the underlying constructs in the TEI Abstract Model are given\n      the same names.\n      \n      This indirection makes it simpler to implement customization of the TEI system in an\n      accessible and human-readable way. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.18\">As further discussed in section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.18.2\" emit=\"transcription\" hash=\"ST\" xml-id=\"ST\">1 The TEI Infrastructure</pb-link>, the TEI encoding schema comprises a set\n      of class and macro declarations, and a number of <span class=\"tei-term\" data-tei=\"1.7.4.46.16.18.4\">modules</span>. Each module is made up\n      of element and attribute declarations, and a schema is made by combining a particular set of\n      modules together. In the absence of any other kind of customization, when modules are combined\n      together: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.16.18.6\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.6.3\">all the elements defined by the module (and described in the corresponding section of\n          these Guidelines) are included in the schema;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.6.5\">each such element is identified by the canonical name given it in these\n          Guidelines;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.6.7\">the content model of each such element is as defined by these Guidelines;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.6.9\">the names, datatypes, and permitted values declared for each attribute associated with\n          each such element are as given in these Guidelines;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.6.11\">the elements comprising element classes and the meaning of macro declarations\n          expressed in terms of element classes is determined by the particular combination of\n          modules selected.</li>\n</ol> The TEI customization mechanisms allow the user to control this behaviour as follows:\n        <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.16.18.8\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.3\">particular elements may be suppressed, removing them from any classes in which they\n          are members, and also from any generated schema; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.5\">new elements may be added to an existing class, thus making them available in macros\n          or content models defined in terms of those classes;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.7\">additional attributes, or attribute values, may be specified for an individual element\n          or for classes of elements; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.9\">within certain limits, attributes, or attribute values, may also be removed either\n          from an individual element or for classes of elements; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.11\">the characteristics inherited by one class from another class may be modified by\n          modifying its class membership: all members of the class then inherit the changed\n          characteristics;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.13\">the set of values legal for an attribute or attribute class may be constrained or\n          relaxed by supplying or modifying a value list, or by modifying its datatype.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.18.8.15\">within certain limits, the name (generic identifier) associated with an element may be\n          changed, without changing the semantic or syntactic properties of the element;</li>\n</ol> The modification mechanisms presented in this section are quite general, and may be\n      used to make all the types of changes just listed. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.20\">The recommended way of implementing and documenting all such modifications is by means of the\n      ODD system described in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.20.2\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>; in the remainder of this section we give\n      specific examples to illustrate how that system may be applied. An ODD processor, such as the\n      Roma application supported by the TEI, or any other comparable set of stylesheets will use the\n      declarations provided by an ODD to generate appropriate sets of declarations in a specific\n      schema language such as RELAX NG or the XML DTD language. We do not discuss in detail here how\n      this should be done, since the details are schema language-specific; some background\n      information about the methods used for XML DTD and RELAX NG schema generation is however\n      provided in section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.20.4\" emit=\"transcription\" hash=\"STIN\" xml-id=\"STIN\">1.2 Defining a TEI Schema</pb-link>. Several example ODD files are also provided as part\n      of the standard TEI release: see further section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.20.6\" emit=\"transcription\" hash=\"MDlite\" xml-id=\"MDlite\">23.3.4 Examples of Modification </pb-link> below.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22\" id=\"MDMD\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.4\">23.3.1 Kinds of Modification</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.6\">For ease of discussion, we distinguish the following different kinds of modification: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.16.22.6.2\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.22.6.2.3\">deletion of elements;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.22.6.2.5\">modification of content models;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.22.6.2.7\">modification of attribute and attribute-value lists;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.22.6.2.9\">modification of class membership;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.22.6.2.11\">addition of new elements.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.16.22.6.2.13\">renaming of elements;</li>\n</ol> Each of these is described in the following sections.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.8\">Each kind of modification changes the set of documents that will be considered valid\n        according to the resulting schema. A schema derived from any combination of unmodified TEI\n        declarations (an \"unmodified schema\") may be thought of as defining a certain set of\n        documents. A schema deriving from a combination of modified TEI declarations (a \"modified\n        schema\") will define a different set of documents. The set of documents valid according to\n        the modified schema may or may not be properly contained by the set of documents considered\n        to be valid according to the unmodified schema. The schema <span class=\"tei-ident3 ident\" data-tei=\"1.7.4.46.16.22.8.2\">TEI-All</span> is the\n        special case of the unmodified schema which includes all currently available TEI modules. We\n        use the term <span class=\"tei-term\" data-tei=\"1.7.4.46.16.22.8.4\">clean modification</span> for cases where the set of documents defined by a\n        modified schema is a proper subset of the set of documents defined by TEI-All. Where this is\n        not the case, that is, where the modified schema considers valid some documents which\n        TEI-All does not, we use the term <span class=\"tei-term\" data-tei=\"1.7.4.46.16.22.8.6\">unclean modification</span>. Despite this\n        terminology, unclean modifications are not particularly deprecated, and their use may often\n        be vital to the success of a project. The concept is introduced solely to distinguish the\n        effects of different kinds of modification.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22.12\" id=\"MDMDSU\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.12.4\">23.3.1.1 Deletion of Elements</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.12.6\">The simplest way to modify the supplied modules is to suppress one or more of the\n          supplied elements. This is simply done by setting the mode attribute to\n            delete on an <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.12.6.6\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> for the element concerned. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.12.8\">For example, if the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.12.8.2\" href=\"/ref/note\" target=\"\">note</a> element is not to be used in a particular application,\n          but has been included via one of the supplied modules, then the schema specification\n          concerned will contain a declaration like the following: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.16.22.12.8.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"note\" mode=\"delete\"/&gt;</pb-code-highlight></div> The ident attribute here supplies the\n          canonical name of the element to be deleted and the mode attribute specifies\n          what is to be done with it. There is no need to specify the module concerned, since\n          element names are unique across all TEI modules. The full specification for a schema in\n          which this modification is applied would thus be something like the following: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.16.22.12.8.10\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;schemaSpec ident=\"mySchema\"&gt;\n              &lt;moduleRef key=\"core\"/&gt;\n              &lt;!-- other modules used by this customization --&gt;\n              &lt;elementSpec ident=\"note\" mode=\"delete\"/&gt;\n            &lt;/schemaSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.12.10\">In most cases, deletion is a clean modification, since most elements are optional.\n          Documents that are valid with respect to the modified schema are also valid according to\n          TEI-All. To say this another way, the set of documents matching the new schema is\n          contained by the set of documents matching the original schema.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.12.12\">There are however some elements in the TEI schema which have mandatory children; for\n          example, the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.12.12.2\" href=\"/ref/listPerson\" target=\"\">listPerson</a> must contain at least one element from the\n            <span class=\"tei-ident3 ident\" data-tei=\"1.7.4.46.16.22.12.12.4\">model.personLike</span> class. If that class has no members because all of its\n          member elements have been removed, then the content model cannot be satisfied. A\n          modification which keeps <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.12.12.6\" href=\"/ref/listPerson\" target=\"\">listPerson</a> but removes all of its possible children\n          would therefore be regarded as unclean. So long as at least one member of the class\n          remains available, however, deleting other members would not have this effect, and would\n          therefore be regarded as a clean modification. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.12.14\">In general, whenever the element deleted by a modification is mandatory within the\n          content model of some other (undeleted) element, the result is an unclean modification,\n          and may also break the TEI Abstract Model (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.12.14.2\" emit=\"transcription\" hash=\"CFAM\" xml-id=\"CFAM\">23.4.3 Conformance to the TEI Abstract Model</pb-link>). However, the parent of\n          a mandatory child can be safely removed if it is itself optional.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.12.16\">To determine whether or not an element is mandatory in a given context, the user must\n          inspect the content model of the element concerned. In most cases, content models are\n          expressed in terms of model classes rather than elements; hence, removing an element will\n          generally be a clean modification, since there will generally be other members of the\n          class available. If a class is completely depopulated by a modification, then the\n          cleanliness of the modification will depend upon whether or not the class reference is\n          mandatory or optional, in the same way as for an individual element.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22.14\" id=\"MDMDCM\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.14.4\">23.3.1.2 Modification of Content Models</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.14.6\">The content model for an element in the TEI schema is defined by means of a\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.2\" href=\"/ref/content\" target=\"\">content</a> element within the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.4\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> which specifies it. For\n          example, the specification for the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.6\" href=\"/ref/term\" target=\"\">term</a> provided by these Guidelines\n          contains a <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.8\" href=\"/ref/content\" target=\"\">content</a> element like the following: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.16.22.14.6.10\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;content&gt;\n              &lt;macroRef key=\"macro.phraseSeq\"/&gt;\n            &lt;/content&gt;\n          </pb-code-highlight></div> This content model consists of a reference to a macro called <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.14.6.12\"><a href=\"/ref/macro.phraseSeq\">macro.phraseSeq</a></span>. Further examination shows that this macro in turn expands to\n          an optional repeatable alternation of text (<a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.14\" href=\"/ref/textNode\" target=\"\">textNode</a>) with references to three\n          other classes (<span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.14.6.16\"><a href=\"/ref/model.gLike\">model.gLike</a></span>, <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.14.6.18\"><a href=\"/ref/model.phrase\">model.phrase</a></span>, or <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.14.6.20\"><a href=\"/ref/model.global\">model.global</a></span>). For some particular\n          application it might be preferable to insist that <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.22\" href=\"/ref/term\" target=\"\">term</a> elements should only\n          contain plain text, excluding these other possibilities.<a class=\"note tei-note\" data-tei=\"1.7.4.46.16.22.14.6.24\" href=\"#fn_1_7_4_46_16_22_14_6_24\" id=\"fnref_1_7_4_46_16_22_14_6_24\" rel=\"footnote\">1</a>\n          This could be achieved simply by supplying a specification for <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.6.26\" href=\"/ref/term\" target=\"\">term</a> like the\n          following: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.14.6.28\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"term\" module=\"core\" mode=\"change\"&gt;\n              &lt;content&gt;\n                &lt;textNode/&gt;\n              &lt;/content&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.14.8\">This is a clean modification which does not change the meaning of a TEI element; there is\n          therefore no need to assign the element to some other namespace than that of the TEI,\n          though it may be considered good practice; see further <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.14.8.2\" emit=\"transcription\" hash=\"MDNS\" xml-id=\"MDNS\">23.3.2 Modification and Namespaces</pb-link> below. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.14.10\">A change of this kind, which simplifies the possible content of an element by reducing\n          its model to one of its existing components, is always clean, because the set of documents\n          matched by the resulting schema is a subset of the set of documents which would have been\n          matched by TEI-All.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.14.12\">Note that content models are generally defined (as far as possible) in terms of\n          references to model classes, rather than to explicit elements. This means that the need to\n          modify content models is greatly reduced: if an element is deleted or modified, for\n          example, then the deletion or modification will be available for every content model which\n          references that element via its class, as well as those which reference it explicitly. For\n          this reason it is not (in general) good practice to replace class references by explicit\n          element references, since this may have unintended side effects. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.14.14\">An unqualified reference to an element class within a content model generates a content\n          model which is equivalent to an alternation of all the members of the class referenced.\n          Thus, a content model which refers to the model class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.14.14.2\"><a href=\"/ref/model.phrase\">model.phrase</a></span> will generate a content model in which any one of the members of\n          that class is equally acceptable. The <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.14.4\" href=\"/ref/classRef\" target=\"\">classRef</a> element used to reference a class\n          has an expand attribute which may be used to vary this behaviour, for example\n          to require <span class=\"tei-q2\" data-tei=\"1.7.4.46.16.22.14.14.8\">an optional repeatable alternation of all members of a class</span>, <span class=\"tei-q2\" data-tei=\"1.7.4.46.16.22.14.14.10\">a\n            sequence containing no more than one of each member of the class</span>, etc. as described\n          further in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.14.14.12\" emit=\"transcription\" hash=\"TDCLA\" xml-id=\"TDCLA\">22.6 Class Specifications</pb-link>. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.14.16\">Content model changes which are not simple restrictions on an existing model should be\n          undertaken with caution. The set of documents matching the schema which results from such\n          changes is unlikely to be contained by the set of documents matching TEI-All, and such\n          changes are therefore regarded as unclean. When content models are changed or extended,\n          care should be taken to respect the existing semantics of the element concerned as stated\n          in these Guidelines. For example, the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.16.2\" href=\"/ref/l\" target=\"\">l</a> is defined as containing a line\n          of verse. It would not therefore make sense to redefine its content model so that it could\n          also include members of the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.14.16.4\"><a href=\"/ref/model.pLike\">model.pLike</a></span> such as\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.16.6\" href=\"/ref/p\" target=\"\">p</a> or <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.14.16.8\" href=\"/ref/ab\" target=\"\">ab</a>. Although syntactically feasible, such a modification would\n          not be regarded as TEI-conformant because it breaks the TEI Abstract Model. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22.16\" id=\"MDMDAL\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.16.4\">23.3.1.3 Modification of Attribute and Attribute Value Lists</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.6\">The attributes applicable to a given element may be specified in two ways: they may be\n          given explicitly, by means of an <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.6.2\" href=\"/ref/attList\" target=\"\">attList</a> element within the corresponding\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.6.4\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, or they may be inherited from an attribute class, as specified in\n          the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.6.6\" href=\"/ref/classes\" target=\"\">classes</a> element. To add a new attribute to an element, the designer should\n          therefore first check to see whether this attribute is already available from some\n          existing attribute class. If it is, then the simplest method of adding it will be to make\n          the element in question a member of that class, as further discussed below. If this is not\n          possible, then a new <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.6.8\" href=\"/ref/attDef\" target=\"\">attDef</a> element must be added to the existing\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.6.10\" href=\"/ref/attList\" target=\"\">attList</a> for the element in question. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.8\">Whichever method is adopted, the modification capabilities are the same as those\n          available for elements. Attributes may be added or deleted from the list, using the\n            mode attribute on <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.8.4\" href=\"/ref/attDef\" target=\"\">attDef</a> in the same way as on <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.8.6\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>.\n          The <span class=\"tei-q2\" data-tei=\"1.7.4.46.16.22.16.8.8\">content</span> of an attribute is defined by means of the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.8.10\" href=\"/ref/datatype\" target=\"\">datatype</a>,\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.8.12\" href=\"/ref/valList\" target=\"\">valList</a>, or <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.8.14\" href=\"/ref/valDesc\" target=\"\">valDesc</a> elements within the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.8.16\" href=\"/ref/attDef\" target=\"\">attDef</a> element. Any\n          of these elements may be changed. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.10\">Suppose, for example, that we wish to add two attributes to the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.10.2\" href=\"/ref/eg\" target=\"\">eg</a> element (used\n          to indicate examples in a text), type to characterize the example in some way,\n          and valid to indicate whether the example is considered valid or not. A quick\n          glance through the Guidelines indicates that the attribute class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.16.10.8\"><a href=\"/ref/att.typed\">att.typed</a></span> could be used to provide the type attribute, but there is\n          no comparable class which will provide a valid attribute. The existing\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.10.14\" href=\"/ref/eg\" target=\"\">eg</a> element in fact has no local attributes defined for it at all: we will\n          therefore need to add not only an <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.10.16\" href=\"/ref/attDef\" target=\"\">attDef</a> element to define the new attribute, but\n          also an <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.10.18\" href=\"/ref/attList\" target=\"\">attList</a> to hold it. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.12\">We begin by adding the new valid attribute: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.16.12.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"eg\" module=\"tagdocs\" mode=\"change\"&gt;\n              &lt;attList&gt;\n                &lt;attDef ident=\"valid\" mode=\"add\" ns=\"http://www.example.com/ns/nonTEI\"&gt;\n                  &lt;desc&gt;indicates whether or not the example is considered to be valid&lt;/desc&gt;\n                  &lt;datatype&gt;\n                    &lt;dataRef key=\"teidata.truthValue\"/&gt;\n                  &lt;/datatype&gt;\n                &lt;/attDef&gt;\n              &lt;/attList&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.14\">The value supplied for the mode attribute on the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.14.4\" href=\"/ref/attDef\" target=\"\">attDef</a> element is\n            add; if this attribute already existed on the element we are modifying this\n          should generate an error, since a specification cannot have more than one attribute of the\n          same name. If the attribute is already present, we can replace the whole of the existing\n          declaration by supplying replace as the value for mode;\n          alternatively, we can change some parts of an existing declaration only by supplying just\n          the new parts, and setting change as the value for mode.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.16\">Because the new attribute is not defined by the TEI, it is good practice to specify a\n          namespace for it on the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.16.2\" href=\"/ref/attDef\" target=\"\">attDef</a>; see further <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.16.16.4\" emit=\"transcription\" hash=\"MDNS\" xml-id=\"MDNS\">23.3.2 Modification and Namespaces</pb-link>.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.18\">As noted above, adding the new type attribute involves changing this element's\n          class membership; we therefore discuss that in the next section (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.16.18.4\" emit=\"transcription\" hash=\"MDMDCL\" xml-id=\"MDMDCL\">23.3.1.4 Class Modification</pb-link>).</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.20\">The canonical name for the new attribute is valid, and is supplied on the\n            ident attribute of the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.20.6\" href=\"/ref/attDef\" target=\"\">attDef</a> element. In this simple example, we\n          supply only a description and datatype for the new attribute; the former is given by the\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.20.8\" href=\"/ref/desc\" target=\"\">desc</a> element, and the latter by the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.20.10\" href=\"/ref/datatype\" target=\"\">datatype</a> element. (There are of\n          course many other pieces of information which could be supplied, as documented in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.16.20.12\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>). The content of the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.20.14\" href=\"/ref/datatype\" target=\"\">datatype</a>\n          element\n          is a <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.20.18\" href=\"/ref/dataRef\" target=\"\">dataRef</a> element which references an existing TEI data specification.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.22\">It is often desirable to constrain the possible values for an attribute to a greater\n          extent than is possible by simply supplying a TEI datatype for it. This facility is\n          provided by the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.22.2\" href=\"/ref/valList\" target=\"\">valList</a> element, which can also appear as a child of the\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.22.4\" href=\"/ref/attDef\" target=\"\">attDef</a> element. Suppose for example that, rather than simply indicating whether\n          or not the example is considered valid by means of the values true and\n            false we wish to provide a more nuanced indication, using encoded values such\n          as A, B, and C. A declaration like the following might be appropriate: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.16.22.10\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;elementSpec ident=\"eg\" module=\"tagdocs\" mode=\"change\"&gt;\n              &lt;attList&gt;\n                &lt;attDef ident=\"valid\" ns=\"http://www.example.com/ns/nonTEI\" mode=\"add\"&gt;\n                  &lt;desc&gt;indicates the validity of the example by supplying one of three predefined\n                    codes for it.&lt;/desc&gt;\n                  &lt;datatype&gt;\n                    &lt;dataRef key=\"teidata.enumerated\"/&gt;\n                  &lt;/datatype&gt;\n                  &lt;valList type=\"closed\"&gt;\n                    &lt;valItem ident=\"A\"&gt;\n                      &lt;desc&gt;validity is of the highest class&lt;/desc&gt;\n                    &lt;/valItem&gt;\n                    &lt;valItem ident=\"B\"&gt;\n                      &lt;desc&gt;validity is of the second highest class&lt;/desc&gt;\n                    &lt;/valItem&gt;\n                    &lt;valItem ident=\"C\"&gt;\n                      &lt;desc&gt;validity is of the lowest class&lt;/desc&gt;\n                    &lt;/valItem&gt;\n                  &lt;/valList&gt;\n                &lt;/attDef&gt;\n              &lt;/attList&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.16.24\">The same technique may be used to replace or extend the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.16.24.2\" href=\"/ref/valList\" target=\"\">valList</a> supplied as part\n          of any attribute in the TEI schema.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22.18\" id=\"MDMDCL\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.18.4\">23.3.1.4 Class Modification</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.6\">The concept of element classes was introduced in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.18.6.2\" emit=\"transcription\" hash=\"STECCM\" xml-id=\"STECCM\">1.3.2 Model Classes</pb-link>; an\n          understanding of it is fundamental to successful use of the TEI system. As noted there, we\n          distinguish <span class=\"tei-term\" data-tei=\"1.7.4.46.16.22.18.6.4\">model classes</span>, the members of which all have structural\n          similarity, from <span class=\"tei-term\" data-tei=\"1.7.4.46.16.22.18.6.6\">attribute classes</span>, the members of which simply share a set\n          of attributes. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.8\">The part of an element specification which determines its class membership is an element\n          called <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.8.2\" href=\"/ref/classes\" target=\"\">classes</a>. All classes to which the element belongs must be specified within\n          this, using a <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.8.4\" href=\"/ref/memberOf\" target=\"\">memberOf</a> element for each. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.10\">To add an element to a class in which it is not already a member, all that is needed is\n          to supply a new <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.10.2\" href=\"/ref/memberOf\" target=\"\">memberOf</a> element within the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.10.4\" href=\"/ref/classes\" target=\"\">classes</a> element for the\n          element concerned. For example, to add an element to the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.10.6\"><a href=\"/ref/att.typed\">att.typed</a></span> class, we include a declaration like the following: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.18.10.8\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"eg\" module=\"tagdocs\" mode=\"change\" ns=\"http://www.example.com/ns/nonTEI\"&gt;\n              &lt;classes mode=\"change\"&gt;\n                &lt;memberOf key=\"att.typed\"/&gt;\n              &lt;/classes&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div> Any existing class memberships for the element being changed are\n          not affected because the mode attribute of the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.10.12\" href=\"/ref/classes\" target=\"\">classes</a> element is set\n          to change (rather than its default value of replace). Consequently,\n          in this case, the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.10.18\" href=\"/ref/eg\" target=\"\">eg</a> element retains its membership of the two classes (<span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.10.20\"><a href=\"/ref/model.common\">model.common</a></span> and <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.10.22\"><a href=\"/ref/model.graphicLike\">model.graphicLike</a></span>) to\n          which it already belongs. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.12\">Equally, to remove the attributes which an element inherits from its membership in some\n          class, all that is needed is to remove the relevant <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.12.2\" href=\"/ref/memberOf\" target=\"\">memberOf</a> element. For\n          example, the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.12.4\" href=\"/ref/term\" target=\"\">term</a> defined in the core module is a member of two attribute\n          classes, <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.12.6\"><a href=\"/ref/att.typed\">att.typed</a></span> and <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.12.8\"><a href=\"/ref/att.declaring\">att.declaring</a></span>. It inherits the attributes type and\n            subtype from the former, and the attribute decls from the latter.\n          To remove the last of these attributes from this element, we need to remove it from that\n          class: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.18.12.16\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"term\" module=\"core\" mode=\"change\"&gt;\n              &lt;classes mode=\"change\"&gt;\n                &lt;memberOf key=\"att.declaring\" mode=\"delete\"/&gt;\n              &lt;/classes&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.14\">If the intention is to change the class membership of an element completely, rather than\n          simply add or remove it to or from one or more classes, the value of the mode\n          attribute of <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.14.4\" href=\"/ref/classes\" target=\"\">classes</a> can be set to replace (which is the default if no\n          value is specified), indicating that the memberships indicated by its child\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.14.8\" href=\"/ref/memberOf\" target=\"\">memberOf</a> elements are the only ones applicable. Thus the following declaration:\n            <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.18.14.10\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"term\" module=\"core\" mode=\"change\" ns=\"http://www.example.com/ns/nonTEI\"&gt;\n              &lt;classes mode=\"replace\"&gt;\n                &lt;memberOf key=\"att.interpLike\"/&gt;\n              &lt;/classes&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div> would have the effect of removing the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.14.12\" href=\"/ref/term\" target=\"\">term</a> from\n          both its existing attribute classes, and adding it to the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.14.14\"><a href=\"/ref/att.interpLike\">att.interpLike</a></span> class.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.16\">If however the mode attribute is set to change, the implication is\n          that the memberships indicated by its child <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.16.6\" href=\"/ref/memberOf\" target=\"\">memberOf</a> elements are to be combined\n          with the existing memberships for the element. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.18\">To change or remove attributes inherited from an attribute class for all members of the\n          class (as opposed to specific members of that class), it is also possible to modify the\n          class specification itself. For example, the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.18.2\"><a href=\"/ref/att.global.rendition\">att.global.rendition</a></span> defines several attributes which are available for all\n          elements, namely rend, style, and rendition. If we decide\n          that we never wish to use the rend attribute, the simplest way of removing it\n          is to supply a modified class specification for <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.18.12\"><a href=\"/ref/att.global.rendition\">att.global.rendition</a></span> as follows: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.16.22.18.18.14\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;classSpec ident=\"att.global.rendition\" type=\"atts\" mode=\"change\"&gt;\n              &lt;attList&gt;\n                &lt;attDef ident=\"rend\" mode=\"delete\"/&gt;\n              &lt;/attList&gt;\n            &lt;/classSpec&gt;\n          </pb-code-highlight></div> Because the mode attribute on the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.18.18\" href=\"/ref/classSpec\" target=\"\">classSpec</a> defining the\n          attributes inherited through membership of this class has the value change, any\n          of its existing identifiable components not specified in the modification above will\n          remain unchanged. The only effect will therefore be to delete the rend\n          attribute from the class, and hence from all elements which are members of the class.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.20\">The classes used in the TEI schema are further discussed in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.18.20.2\" emit=\"transcription\" hash=\"ST\" xml-id=\"ST\">1 The TEI Infrastructure</pb-link>.\n          Note in particular that classes are themselves classified: the attributes inherited by a\n          member of attribute class A may come to it directly from that class, or from another class\n          of which A is itself a member. For example, the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.4\"><a href=\"/ref/att.global\">att.global</a></span> is itself a member of the classes <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.6\"><a href=\"/ref/att.global.linking\">att.global.linking</a></span> and <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.8\"><a href=\"/ref/att.global.analytic\">att.global.analytic</a></span>. By\n          default, these two classes are predefined as empty. However, if (for example) the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.10\"><a href=\"/ref/linking\">linking</a></span> module is included in a schema, a number of attributes\n            (corresp, sameAs, etc.) are defined as members of the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.16\"><a href=\"/ref/att.global.linking\">att.global.linking</a></span> class. All elements which are members of <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.18\"><a href=\"/ref/att.global\">att.global</a></span> will then inherit these new attributes (see further\n          section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.18.20.20\" emit=\"transcription\" hash=\"STECAT\" xml-id=\"STECAT\">1.3.1 Attribute Classes</pb-link>). A new attribute may thus be added to the global class in\n          two ways: either by adding it to the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.18.20.22\" href=\"/ref/attList\" target=\"\">attList</a> defined within the class\n          specification for <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.24\"><a href=\"/ref/att.global\">att.global</a></span>; or by defining a new attribute\n          class, and changing the class membership of the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.18.20.26\"><a href=\"/ref/att.global\">att.global</a></span>\n          class to reference it. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.22\">Such global changes should be undertaken with caution: in general removing existing\n          non-mandatory attributes from a class will always be a clean modification, in the same way\n          as removing non-mandatory elements. Adding a new attribute to a class however can be a\n          clean modification only if the new attribute is labelled as belonging to some namespace\n          other than the TEI.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.18.24\">The same mechanisms are available for modification of model classes. Care should be taken\n          when modifying the model class membership of existing elements since model class\n          membership is what determines the content model of most elements in the TEI schema, and a\n          small change may have unintended consequences. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22.20\" id=\"MDMDNE\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.20.4\">23.3.1.5 Addition of New Elements</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.20.6\">To add a completely new element into a schema involves providing a complete element\n          specification for it. It is recommended that the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.6.2\" href=\"/ref/classes\" target=\"\">classes</a> element of this new\n          declaration should include a reference to at least one TEI model class. Without such a\n          reference, the new element would not otherwise be referenced by the content model of any\n          other TEI element, and would therefore be inaccessible within a TEI document. It is also\n          possible to modify the content models of one or more existing elements to refer to the new\n          element explicitly, as discussed in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.20.6.4\" emit=\"transcription\" hash=\"MDMDCM\" xml-id=\"MDMDCM\">23.3.1.2 Modification of Content Models</pb-link>\n           but this will generally be less convenient. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.20.8\">For example, the three elements <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.8.2\" href=\"/ref/bibl\" target=\"\">bibl</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.8.4\" href=\"/ref/biblFull\" target=\"\">biblFull</a>, and <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.8.6\" href=\"/ref/biblStruct\" target=\"\">biblStruct</a>\n          are all defined as members of the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.22.20.8.8\"><a href=\"/ref/model.biblLike\">model.biblLike</a></span>. To add\n          a fourth member (say <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.8.10\" href=\"/ref/myBibl\" target=\"\">myBibl</a>) to this class, we need to include\n          in the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.8.12\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> defining our new element a <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.20.8.14\" href=\"/ref/memberOf\" target=\"\">memberOf</a> element which\n          nominates the intended class: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.22.20.8.16\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"myBibl\" mode=\"add\" ns=\"http://www.example.com/ns/nonTEI\"&gt;\n              &lt;classes&gt;\n                &lt;memberOf key=\"model.biblLike\"/&gt;\n              &lt;/classes&gt;\n              &lt;!-- other parts of the new declaration here --&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div> The other parts of this declaration will typically include a\n          description for the new element and information about its content model, its attributes,\n          etc., as further described in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.20.8.18\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.22.22\" id=\"MDMDNM\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.16.22.22.4\">23.3.1.6 Renaming of Elements</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.22.6\">Every element and other named markup construct in the TEI schema has a <span class=\"tei-term\" data-tei=\"1.7.4.46.16.22.22.6.2\">canonical\n          name</span>, usually composed of English language words or syllables: this name is supplied as the value of the\n          ident attribute on the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.6.6\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.6.8\" href=\"/ref/attDef\" target=\"\">attDef</a>,\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.6.10\" href=\"/ref/classSpec\" target=\"\">classSpec</a>, or <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.6.12\" href=\"/ref/macroSpec\" target=\"\">macroSpec</a> used to define it. In some circumstances, it may be\n          convenient for the element or attribute\n          declaration used within a schema generated from that specification to take a different form, for example, permitting schemas to use generic identifiers\n          from a different language, or in an abbreviated form. There may be many alternative\n          identifiers for the same markup construct, and an ODD processor may choose which of them\n          to use for a given purpose. Each such alternative name is supplied by means of an\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.6.14\" href=\"/ref/altIdent\" target=\"\">altIdent</a> element within the specification element concerned.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.22.8\">For example, the following declaration converts <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.8.2\" href=\"/ref/note\" target=\"\">note</a> to <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.8.4\" href=\"/ref/nt\" target=\"\">nt</a>: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.16.22.22.8.6\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;elementSpec ident=\"note\" module=\"core\" mode=\"change\"&gt;\n              &lt;altIdent&gt;nt&lt;/altIdent&gt;\n            &lt;/elementSpec&gt;</pb-code-highlight></div> Note that the mode attribute on the\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.8.10\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> now takes the value change to indicate that those parts\n          of the element specification not supplied are to be inherited from the standard\n          definition. The content of the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.22.22.8.14\" href=\"/ref/altIdent\" target=\"\">altIdent</a> element is now available for use in place of the\n          canonical ident value in the schema generated. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.22.22.10\">Renaming in this way is  is an\n          inherently unclean modification (because the set of documents matched by the resulting\n          schema is not contained by the set matched by TEI-All), even though the process of\n          converting any document in which elements have been renamed into an exactly equivalent\n          document using canonical names is completely deterministic. Documents using such a schema should not claim to be\n          in the TEI namespace,  but either use a null namespace or some user-defined\n          namespace, as further discussed in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.22.10.6\" emit=\"transcription\" hash=\"MDNS\" xml-id=\"MDNS\">23.3.2 Modification and Namespaces</pb-link>; this is necessary to\n          avoid the risk of name collision between the new name and all existing TEI names as well as for reasons\n          of conformance\n          (see further <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.22.22.10.8\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>).</p>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.24\" id=\"MDNS\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.16.24.4\">23.3.2 Modification and Namespaces</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.6\">All the elements defined by the TEI schema are labelled as belonging to a single\n          <span class=\"tei-term\" data-tei=\"1.7.4.46.16.24.6.2\">namespace</span>, maintained by the TEI and with the URI\n          http://www.tei-c.org/ns/1.0.<a class=\"note tei-note\" data-tei=\"1.7.4.46.16.24.6.6\" href=\"#fn_1_7_4_46_16_24_6_6\" id=\"fnref_1_7_4_46_16_24_6_6\" rel=\"footnote\">2</a>\n        Only elements which are unmodified or which have undergone a clean modification may use this\n        namespace. Note however that TEI-defined attributes are not associated with any namespace.\n        </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.8\">This implies that any other modification\n         must either specify a different\n        namespace or, equivalently, specify no namespace at all. The ns attribute is\n        provided on elements <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.8.6\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.8.8\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, and <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.8.10\" href=\"/ref/attDef\" target=\"\">attDef</a> for this\n        purpose. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.10\">Suppose, for example, that we wish to add a new attribute topic to the existing TEI element <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.10.4\" href=\"/ref/p\" target=\"\">p</a>. In the absence of namespace\n        considerations, this would be an unclean modification, since <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.10.6\" href=\"/ref/p\" target=\"\">p</a> does not currently\n        have such an attribute. The most appropriate action is to explicitly attach the new\n        attribute to a new namespace by a declaration such as the following: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.24.10.8\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"p\" mode=\"change\"&gt;\n            &lt;attList&gt;\n              &lt;attDef ident=\"topic\" mode=\"add\" ns=\"http://www.example.org/ns/nonTEI\"&gt;\n                &lt;desc&gt;indicates the topic of a TEI paragraph&lt;/desc&gt;\n                &lt;datatype&gt;&lt;dataRef key=\"teidata.word\"/&gt;&lt;/datatype&gt;\n              &lt;/attDef&gt;\n            &lt;/attList&gt;\n          &lt;/elementSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.12\">Document instances using a schema derived from this ODD can now indicate clearly the status\n        of this attribute: <div class=\"tei-ex_egXML1 full\" data-tei=\"1.7.4.46.16.24.12.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;div xmlns:my=\"http://www.example.org/ns/nonTEI\"&gt;\n            &lt;!-- ... --&gt;\n            &lt;p n=\"12\" my:topic=\"rabbits\"&gt;Flopsy, Mopsy, Cottontail, and Peter...&lt;/p&gt;\n          &lt;/div&gt;</pb-code-highlight></div></p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.14\">Since topic is explicitly labelled as belonging to something\n        other than the TEI namespace, we regard the modification which introduced it as clean. A\n        namespace-aware processor will be able to validate those elements in the TEI namespace\n        against the unmodified schema.<a class=\"note tei-note\" data-tei=\"1.7.4.46.16.24.14.4\" href=\"#fn_1_7_4_46_16_24_14_4\" id=\"fnref_1_7_4_46_16_24_14_4\" rel=\"footnote\">3</a></p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.16\">Similar considerations apply when modification is made to the content model or some other\n        aspect of an element, or when a new element is declared.\n        All such changes should be explicitly\n        labelled as belonging to some non-TEI namespace or to no namespace at all.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.18\">If the ns attribute is supplied on a <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.18.4\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> element, it identifies\n        the namespace applicable to all components of the schema being specified. Even if such a\n        schema includes unmodified modules from the TEI namespace, the elements contained by such\n        modules will now be regarded as belonging to the namespace specified on the\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.24.18.6\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a>. This can be useful if it is desired simply to avoid namespace\n        processing. For example, the following schema specification results in a schema called\n          <span class=\"tei-ident3 ident\" data-tei=\"1.7.4.46.16.24.18.8\">noName</span> which has no namespace, even though it comprises declarations from\n        the TEI <span class=\"tei-ident1\" data-tei=\"1.7.4.46.16.24.18.10\"><a href=\"/ref/header\">header</a></span> module: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.16.24.18.12\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">&lt;schemaSpec ns=\"\" ident=\"noName\"&gt;\n            &lt;moduleRef key=\"header\"/&gt;\n            &lt;!-- ... --&gt;\n          &lt;/schemaSpec&gt;</pb-code-highlight></div>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.24.20\">In addition to the TEI canonical namespace mentioned above, the TEI may also define\n        namespaces for approved translations of the TEI schema into other languages.\n        \n        The namespace for such translations is the same as that for the canonical namespace,\n        suffixed by the appropriate ISO language identifier (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.24.20.4\" emit=\"transcription\" hash=\"CHSH\" xml-id=\"CHSH\">6.1 Language Identification</pb-link>). A schema\n        specification using the Chinese translation, for example, would use the namespace <span class=\"tei-ident2\" data-tei=\"1.7.4.46.16.24.20.6\">http://www.tei-c.org/ns/1.0/zh</span>\n</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.26\" id=\"MDDO\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.16.26.4\">23.3.3 Documenting the Modification</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.26.6\">The elements used to define a TEI customization (<a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.6.2\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.6.4\" href=\"/ref/moduleRef\" target=\"\">moduleRef</a>,\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.6.6\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, etc.) will typically be used within a TEI document which supplies\n        further information about the intended use of the new schema, the meaning and application of\n        any new or modified elements within it, and so on. This document will typically conform to a\n         schema which includes components from the module described in\n        chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.26.6.10\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>.<a class=\"note tei-note\" data-tei=\"1.7.4.46.16.26.6.12\" href=\"#fn_1_7_4_46_16_26_6_12\" id=\"fnref_1_7_4_46_16_26_6_12\" rel=\"footnote\">4</a></p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.26.8\">Where the customization to be documented simply consists in a selection of TEI modules,\n        perhaps with some deletion of unwanted elements or attributes, the documentation need not\n        specify anything further. Even here however it may be considered worthwhile to replace some\n        of the semantic information provided by the unmodified TEI specification. For example, the\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.8.2\" href=\"/ref/desc\" target=\"\">desc</a> element of an unmodified TEI <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.8.4\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> may describe an element in\n        terms more general than appropriate to a particular project, or the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.8.6\" href=\"/ref/exemplum\" target=\"\">exemplum</a>\n        elements within it may not illustrate the project's actual intended usage of the element, or\n        the <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.8.8\" href=\"/ref/remarks\" target=\"\">remarks</a> element may contain discussions of matters irrelevant to the project.\n        These elements may therefore be replaced or deleted within an <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.8.10\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> as\n        necessary. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.26.12\">Radical revision is also possible. It is feasible to produce a modification in which the\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.12.2\" href=\"/ref/teiHeader\" target=\"\">teiHeader</a> or <a class=\"tei-gi\" data-tei=\"1.7.4.46.16.26.12.4\" href=\"/ref/text\" target=\"\">text</a> elements are not required, or in which any other rule\n        stated in these Guidelines is either not enforced or not enforceable. In fact, the\n        mechanism, if used in an extreme way, permits replacement of all that the TEI has to say\n        about every component of its schema. Such revisions would result in documents that are not\n        TEI-conformant in even the broadest sense, and it is not intended that encoders use the\n        mechanism in this way. We discuss exactly what is meant by the concept of <span class=\"tei-term\" data-tei=\"1.7.4.46.16.26.12.6\">TEI\n          conformance</span> in the next section, <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.26.12.8\" emit=\"transcription\" hash=\"CF\" xml-id=\"CF\">23.4 Conformance</pb-link>. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.16.28\" id=\"MDlite\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.16.28.4\">23.3.4 Examples of Modification </h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.28.6\">Several examples of customizations of the TEI are provided as part of the standard release.\n        They include the following: <dl class=\"tei-list3\" data-tei=\"1.7.4.46.16.28.6.2\"><dt data-tei=\"1.7.4.46.16.28.6.2.5\"><span class=\"tei-label\" data-tei=\"1.7.4.46.16.28.6.2.3\">tei_bare</span></dt><dd data-tei=\"1.7.4.46.16.28.6.2.5\">The schema generated from this customization is the minimum needed for TEI\n            Conformance. It provides only a handful of elements. </dd><dt data-tei=\"1.7.4.46.16.28.6.2.9\"><span class=\"tei-label\" data-tei=\"1.7.4.46.16.28.6.2.7\">tei_all</span></dt><dd data-tei=\"1.7.4.46.16.28.6.2.9\">The schema generated from this customization combines all available TEI modules,\n            providing 590 elements.</dd><dt data-tei=\"1.7.4.46.16.28.6.2.13\"><span class=\"tei-label\" data-tei=\"1.7.4.46.16.28.6.2.11\">tei_allPlus</span></dt><dd data-tei=\"1.7.4.46.16.28.6.2.13\">The schema generated from this customization combines all available TEI modules with\n            three other non-TEI vocabularies, specifically MathML, SVG, and XInclude.</dd></dl>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.28.8\">It is unlikely that any project would wish to use any of these extremes unchanged. However,\n        they form a useful starting point for customization, whether by removing modules from\n        tei_all or tei_allPlus, or by replacing elements deleted from tei_bare. They also\n        demonstrate how an ODD document may be constructed to provide a basic reference manual to\n        accompany schemas generated from it.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.28.10\">Shortly after publication of the first edition of these Guidelines, as a demonstration of\n        how the TEI encoding schema might be adopted to meet 90% of the needs of 90% of the TEI user\n        community, the TEI editors produced a brief tutorial defining one specific\n          clean modification of the TEI schema, which they called TEI Lite.\n        This tutorial and its associated DTD became very popular and are still available from the\n        TEI web site at <span class=\"tei-ptr4\" data-tei=\"1.7.4.46.16.28.10.4\"><a href=\"http://www.tei-c.org/Guidelines/Customization/Lite/\">http://www.tei-c.org/Guidelines/Customization/Lite/</a></span>. The\n        tutorial and associated schema specification is also included as one of the exemplars\n        provided with TEI P5. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.28.12\">An updated and expanded version of this schema known as <span class=\"tei-ident3 ident\" data-tei=\"1.7.4.46.16.28.12.2\">TEI simplePrint</span> was\n        added to the Exemplars at release 3.1.0. The elements it defines have been modified to take\n        advantage of the processing model features (see further <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.16.28.12.6\" emit=\"transcription\" hash=\"TDPM\" xml-id=\"TDPM\">22.5.4 Processing Models</pb-link>) introduced to the Guidelines at release 3.0.0. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.16.28.14\">The exemplars provided with TEI P5 also include a customization file from which a schema\n        for the validation of other customization files may be generated. This ODD, called tei_odds,\n        combines the four basic modules with the tagdocs, dictionaries, gaiji, linking, and figures\n        modules and also provides facilities for including RELAX NG or Schematron code within a\n        document.\n        </p>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18\" id=\"CF\">\n<h2 class=\"tei-head9\" data-tei=\"1.7.4.46.18.4\">23.4 Conformance</h2>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.6\">The notion of <span class=\"tei-term\" data-tei=\"1.7.4.46.18.6.2\">TEI Conformance</span> is intended to assist in the description of the\n      format and contents of a particular XML document instance or set of documents. It may be found\n      useful in such situations as: <ul class=\"tei-list3 bulleted\" data-tei=\"1.7.4.46.18.6.4\"><li class=\"tei-item\" data-tei=\"1.7.4.46.18.6.4.3\"> interchange or integration of documents amongst different researchers or users; </li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.6.4.5\">software specifications for TEI-aware processing tools; </li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.6.4.7\"> agreements for the deposit of texts in, and distribution of texts from, archives; </li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.6.4.9\"> specifying the form of documents to be produced by or for a given project. </li></ul> It is not intended to provide any other evaluation, for example of scholarly merit,\n      intellectual integrity, or value for money. A document may be of major intellectual importance\n      and yet not be TEI-conformant; a TEI-conformant document may be of no scholarly value\n      whatsoever.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.8\">In this section we explore several aspects of conformance, and in particular attempt to\n      define how the term <span class=\"tei-term\" data-tei=\"1.7.4.46.18.8.2\">TEI-conformant</span> should be used. The terminology defined here\n      should be considered normative: users and implementors of the TEI Guidelines should use the\n      phrases TEI-conformant and\n        TEI Extension only in the senses given and with the usages described. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.10\"> A document is <span class=\"tei-term\" data-tei=\"1.7.4.46.18.10.2\">TEI-conformant</span> if it: <ul class=\"tei-list3 bulleted\" data-tei=\"1.7.4.46.18.10.4\"><li class=\"tei-item\" data-tei=\"1.7.4.46.18.10.4.3\"> is a well-formed XML document (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.10.4.3.2\" emit=\"transcription\" hash=\"CFWF\" xml-id=\"CFWF\">23.4.1 Well-formedness Criterion</pb-link>)</li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.10.4.5\">can be validated against a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.10.4.5.2\">TEI Schema</span>, that is, a schema derived from the\n          TEI Guidelines (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.10.4.5.4\" emit=\"transcription\" hash=\"CFVL\" xml-id=\"CFVL\">23.4.2 Validation Constraint</pb-link>)</li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.10.4.7\"> conforms to the TEI Abstract Model (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.10.4.7.2\" emit=\"transcription\" hash=\"CFAM\" xml-id=\"CFAM\">23.4.3 Conformance to the TEI Abstract Model</pb-link>)</li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.10.4.9\"> uses the <span class=\"tei-term\" data-tei=\"1.7.4.46.18.10.4.9.2\">TEI namespace</span> (and other namespaces where relevant) correctly\n            (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.10.4.9.4\" emit=\"transcription\" hash=\"CFNS\" xml-id=\"CFNS\">23.4.4 Use of the TEI Namespace</pb-link>)</li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.10.4.11\"> is documented by means of a TEI-conformant <span class=\"tei-term\" data-tei=\"1.7.4.46.18.10.4.11.2\">ODD file</span> (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.10.4.11.4\" emit=\"transcription\" hash=\"CFOD\" xml-id=\"CFOD\">23.4.5 Documentation Constraint</pb-link>) which refers to the TEI Guidelines </li></ul> Each of these criteria is discussed in more detail below. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.14\">A document is said to use a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.14.2\">TEI Extension</span> if it is a well-formed XML document\n      which is valid against a TEI Schema which contains additional distinctions, representing\n      concepts not present in the TEI Abstract Model, and therefore not documented in these\n      Guidelines. Such a document \n      cannot necessarily be transformed automatically to a TEI-conformant document without loss of\n      information. However, since one of the goals of the TEI is to support extensions and\n      modifications, it should not be assumed that no TEI document can include extensions: an\n      extension which is expressed by means of the recommended mechanisms is also a TEI-conformant\n      document provided that those parts of it which are not extensions are\n      TEI-conformant.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.16\">A TEI-conformant document is said to follow <span class=\"tei-term\" data-tei=\"1.7.4.46.18.16.4\">TEI Recommended\n        Practice</span> if, wherever these Guidelines prefer one encoding practice to another, the\n      preferred practice is used.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.18\" id=\"CFWF\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.18.18.4\">23.4.1 Well-formedness Criterion</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.18.6\">These Guidelines mandate the use of well-formed XML as representation format. Documents\n        must conform to the World Wide Web Consortium recommendation of the <span class=\"tei-title5\" data-tei=\"1.7.4.46.18.18.6.2\">Extensible Markup\n          Language (XML) 1.0 (Fourth Edition)</span> or successor editions found at <span class=\"tei-ptr4\" data-tei=\"1.7.4.46.18.18.6.4\"><a href=\"http://www.w3.org/TR/xml/\">http://www.w3.org/TR/xml/</a></span>. Other ways of\n        representing the concepts of the TEI Abstract Model are possible, and other representations\n        may be considered appropriate for use in particular situations (for example, for data\n        capture, or project-internal processing). But such alternative representations\n         should not be\n        considered in any way TEI-conformant.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.18.8\">Previous versions of these Guidelines used SGML as a representation format. With the\n        release of P5, the only representation format supported by these Guidelines became valid\n        XML; legacy documents in SGML format should therefore be converted using appropriate\n        software.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.18.10\">A TEI-conformant document must use the TEI namespace, and therefore must also include an\n        XML-conformant namespace declaration, as defined below (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.18.10.2\" emit=\"transcription\" hash=\"CFNS\" xml-id=\"CFNS\">23.4.4 Use of the TEI Namespace</pb-link>).</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.18.12\">The use of XML greatly reduces the need to consider hardware or software differences\n        between processing environments when exchanging data. No special packing or interchange\n        format is required for an XML document, beyond that defined by the W3C recommendations, and\n        no special interchange format is therefore proposed by these\n        Guidelines. For discussion of encoding issues that may arise in the processing of special\n        character sets or non-standard writing systems, see further chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.18.12.4\" emit=\"transcription\" hash=\"CH\" xml-id=\"CH\">6 Languages and Character Sets</pb-link>.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.18.14\">In addition to the well-formedness criterion, the W3C defines the notion of a\n          <span class=\"tei-term\" data-tei=\"1.7.4.46.18.18.14.2\">valid</span> document, as being a well-formed document which matches a specific set\n        of rules or syntactic constraints, defined by a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.18.14.4\">schema</span>. As noted above, TEI\n        conformance implies that the schema used to determine validity of a given document should be\n        derived from the present Guidelines, by means of an ODD which references and documents\n        components which these Guidelines define. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.20\" id=\"CFVL\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.18.20.4\">23.4.2 Validation Constraint</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.20.6\">All <span class=\"tei-term\" data-tei=\"1.7.4.46.18.20.6.2\">TEI-conformant</span> documents must validate against a schema file that has been\n        derived from the published TEI Guidelines, combined and documented in the manner described\n        in section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.20.6.4\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>. We call the formal output of this process a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.20.6.6\">TEI\n          Schema</span>. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.20.8\">The TEI does not mandate use of any particular schema language, only that this schema<a class=\"note tei-note\" data-tei=\"1.7.4.46.18.20.8.2\" href=\"#fn_1_7_4_46_18_20_8_2\" id=\"fnref_1_7_4_46_18_20_8_2\" rel=\"footnote\">5</a> should have been generated from a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.20.8.4\">TEI ODD file</span> that references the\n        TEI Guidelines. Currently available tools permit the expression of schemas in any or all of\n        the XML DTD language, W3C XML Schema, and RELAX NG (both compact and XML formats). Some of\n        what is syntactically possible using the ODD formalism cannot be represented by all schema\n        languages; and there are some features of some schema languages which have no counterpart in\n        ODD. No single schema language fully captures all the constraints implied by conformance to\n        the TEI Abstract Model. A document which is valid according to a TEI schema represented\n        using one schema language may not be valid against the same schema expressed in other\n        languages; for example, the DTD language does not  support namespaces.\n        </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.20.10\">As noted in section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.20.10.2\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>, many varieties of TEI schema are possible and not\n        all of them are necessarily <span class=\"tei-term\" data-tei=\"1.7.4.46.18.20.10.4\">TEI-conformant</span>; derivation from an ODD is a\n        necessary but not a sufficient condition for TEI Conformance.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.22\" id=\"CFAM\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.18.22.4\">23.4.3 Conformance to the TEI Abstract Model</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.6\">The <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.6.2\">TEI Abstract Model</span> is the conceptual schema instantiated by the TEI\n        Guidelines. These Guidelines define, both formally and informally, a set of abstract\n        concepts such as <span class=\"tei-q2\" data-tei=\"1.7.4.46.18.22.6.4\">paragraph</span> or <span class=\"tei-q2\" data-tei=\"1.7.4.46.18.22.6.6\">heading</span>, and their structural relationships, for\n        example stating that paragraphs do not contain\n          headings. These Guidelines also define classes of elements, which\n        have both semantic and structural properties in common. Those semantic and structural\n        properties are also a part of the TEI Abstract Model; the class membership of an existing\n        TEI element cannot therefore be changed without changing the model. Elements can however be\n        removed from a class by deletion, and new non-TEI elements within their own namespaces can\n        be added to existing TEI classes.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.22.8\" id=\"CFAMsc\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.18.22.8.4\">23.4.3.1 Semantic Constraints</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.8.6\">It is an important condition of TEI conformance that elements defined in the TEI\n          Guidelines as having one specific meaning should not be used with another. For example,\n          the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.8.6.2\" href=\"/ref/l\" target=\"\">l</a> is defined in the TEI Guidelines as containing a line of verse. A\n          schema in which it is redefined to mean a typographic line, or an ordered queue of objects\n          of some kind, cannot therefore be TEI-conformant, whatever its other properties.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.8.8\">The semantics of elements defined in the TEI Guidelines are conveyed in a number of ways,\n          ranging from formally verifiable datatypes to informal descriptive prose. In addition, a\n          mapping between TEI elements and concepts in other conceptual models may be provided by\n          the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.8.8.2\" href=\"/ref/equiv\" target=\"\">equiv</a> element where this is available. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.8.10\">A schema which shares equivalent concepts to those of the TEI conceptual model may be\n          mappable to the TEI Schema by means of such a mechanism. For example, the concept of\n          paragraph expressed in the TEI schema by the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.8.10.2\" href=\"/ref/p\" target=\"\">p</a> element is probably the same\n          concept as that expressed in the DocBook schema by the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.8.10.4\" href=\"/ref/para\" target=\"\">para</a> element.\n          Such\n          areas of overlap facilitate\n          interchange\n          because elements from one namespace may be readily integrated with those from another, but\n          do not affect the definition of conformance.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.8.12\">A document is said to conform to the <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.8.12.2\">TEI Abstract Model</span> if features for\n          which an encoding is proposed by the TEI Guidelines are encoded within it using the markup\n          and other syntactic properties defined by means of a valid <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.8.12.4\">TEI-conformant</span>\n          schema. Hence, even though the names of elements or attributes may vary, a TEI-conformant\n          document must respect the TEI Semantic Model, and be valid with respect to a\n          TEI-conformant Schema. Although it may be possible to transform a document which follows\n          the <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.8.12.6\">TEI Abstract Model</span> into a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.8.12.8\">TEI-conformant</span> document, such a\n          document is not itself conformant.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.8.14\">As noted above, the notion of semantic conformance cannot be completely enforced in a\n          formal way. The TEI conceptual model is expressed by means of formal specification in a\n          customization file, by means of descriptive prose in the body of these Guidelines, and\n          implicitly by examples of usage. Any inconsistency between, for example, the text of these\n          Guidelines and a part of a specification should be considered an error and reported to the\n          TEI Council for correction. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.22.10\" id=\"CFAMmc\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.18.22.10.4\">23.4.3.2 Mandatory Components of a TEI Document</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.22.10.6\">It is a long-standing requirement for any <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.10.6.2\">TEI-conformant</span> document that it\n          should contain a <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.4\" href=\"/ref/teiHeader\" target=\"\">teiHeader</a> element. To be more specific a\n            <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.10.6.6\">TEI-conformant</span> document must contain <ul class=\"tei-list3\" data-tei=\"1.7.4.46.18.22.10.6.8\"><li class=\"tei-item\" data-tei=\"1.7.4.46.18.22.10.6.8.2\"> a single <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.8.2.2\" href=\"/ref/teiHeader\" target=\"\">teiHeader</a> element followed by one or more elements from the\n                <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.22.10.6.8.2.4\"><a href=\"/ref/model.resource\">model.resource</a></span> class; or</li><li class=\"tei-item\" data-tei=\"1.7.4.46.18.22.10.6.8.4\"> in the case of a corpus or collection, a single overall <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.8.4.2\" href=\"/ref/teiHeader\" target=\"\">teiHeader</a>\n              element followed by a series of <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.8.4.4\" href=\"/ref/TEI\" target=\"\">TEI</a> elements each with its own\n                <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.8.4.6\" href=\"/ref/teiHeader\" target=\"\">teiHeader</a></li></ul> All <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.10\" href=\"/ref/teiHeader\" target=\"\">teiHeader</a> elements in a <span class=\"tei-term\" data-tei=\"1.7.4.46.18.22.10.6.12\">TEI-conformant</span> document must\n          include elements for: <dl class=\"tei-list3\" data-tei=\"1.7.4.46.18.22.10.6.14\"><dt data-tei=\"1.7.4.46.18.22.10.6.14.5\"><span class=\"tei-label\" data-tei=\"1.7.4.46.18.22.10.6.14.3\">Title Statement</span></dt><dd data-tei=\"1.7.4.46.18.22.10.6.14.5\">This should include the title of the TEI document expressed using a\n                <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.14.5.2\" href=\"/ref/titleStmt\" target=\"\">titleStmt</a> element.</dd><dt data-tei=\"1.7.4.46.18.22.10.6.14.9\"><span class=\"tei-label\" data-tei=\"1.7.4.46.18.22.10.6.14.7\">Publication Statement</span></dt><dd data-tei=\"1.7.4.46.18.22.10.6.14.9\">This should include the place and date of publication or distribution of the TEI\n              document, expressed using the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.14.9.2\" href=\"/ref/publicationStmt\" target=\"\">publicationStmt</a> element.</dd><dt data-tei=\"1.7.4.46.18.22.10.6.14.13\"><span class=\"tei-label\" data-tei=\"1.7.4.46.18.22.10.6.14.11\">Source Statement</span></dt><dd data-tei=\"1.7.4.46.18.22.10.6.14.13\">For a document derived from some previously existing document, this must include a\n              bibliographic description of that source. For a document not so derived, this must\n              include a brief statement that the document has no pre-existing source. In either\n              case, this will be expressed using the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.22.10.6.14.13.2\" href=\"/ref/sourceDesc\" target=\"\">sourceDesc</a> element. </dd></dl></p>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.24\" id=\"CFNS\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.18.24.4\">23.4.4 Use of the <span class=\"tei-term\" data-tei=\"1.7.4.46.18.24.4.2\">TEI Namespace</span></h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.24.6\">The Namespaces Recommendation of the W3C (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.24.6.2\" emit=\"transcription\" hash=\"NAMESPACES\" xml-id=\"NAMESPACES\">1 </pb-link>) provides a way for\n        an XML document to combine markup from different vocabularies without risking name collision\n        and consequent processing difficulties. While the scope of the TEI is large, there are many\n        areas in which it makes no particular recommendation, or where it recommends that other\n        defined markup schemas should be adopted, such as graphics or mathematics. It is also\n        considered desirable that users of other markup schemas should be able to integrate\n        documents using TEI markup with their own system. To meet these objectives without\n        compromising the reliability of its encoding, a TEI-conformant document is required to make\n        appropriate use of the TEI namespace.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.24.8\">Essentially all elements in a TEI Schema which represents concepts from the TEI Abstract\n        Model belong to the TEI namespace, <span class=\"tei-ident2\" data-tei=\"1.7.4.46.18.24.8.2\">http://www.tei-c.org/ns/1.0</span>,\n        maintained by the TEI. A TEI-conformant document is required to declare the namespace for\n        all the elements it contains whether these come from the TEI namespace or from other\n        schemas. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.24.10\">A TEI Schema may be created which assigns TEI elements to some other namespace, or to no\n        namespace at all. A document using such a schema cannot be considered\n        TEI-conformant. A document which places non-TEI\n        elements or attributes within the TEI namespace cannot be considered TEI-conformant; such\n        practices are strongly deprecated as they may lead to serious difficulties for processing or\n        interchange. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.26\" id=\"CFOD\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.18.26.4\">23.4.5 Documentation Constraint</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.26.6\">As noted in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.26.6.2\" emit=\"transcription\" hash=\"CFVL\" xml-id=\"CFVL\">23.4.2 Validation Constraint</pb-link> above, a TEI Schema can only be generated from a TEI ODD,\n        which also serves to document the semantics of the elements defined by it. A TEI-conformant\n        document should therefore always be accompanied by (or refer to) a valid <span class=\"tei-term\" data-tei=\"1.7.4.46.18.26.6.4\">TEI ODD\n          file</span> specifying which modules, elements, classes, etc. are in use together with any\n        modifications applied, and from which a TEI Schema can be generated to\n        validate the document. The TEI supplies a number of predefined <span class=\"tei-term\" data-tei=\"1.7.4.46.18.26.6.8\">TEI Customization\n          exemplar ODD files</span> and the schemas already generated from them (see <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.18.26.6.10\" emit=\"transcription\" hash=\"MDlite\" xml-id=\"MDlite\">23.3.4 Examples of Modification </pb-link>), but most projects will typically need to customize the TEI beyond\n        what these examples provide. It is assumed, for example, that most projects will customize\n        the TEI schema by removing those elements that are not needed for the texts they are\n        encoding, and by providing further constraints on the attribute values and element content\n        models the TEI provides. All such customizations must be specified by means of a valid\n          <span class=\"tei-term\" data-tei=\"1.7.4.46.18.26.6.12\">TEI ODD</span> file. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.26.8\">As different sorts of customization have different implications for the interchange and\n        interoperability of TEI documents, it cannot be assumed that every customization will\n        necessarily result in a schema that validates only TEI-conformant documents. The ODD\n        language permits modifications which conflict with the TEI Abstract Model, even though\n        observing this model is a requirement for TEI Conformance. The ODD language can in fact be\n        used to describe many kinds of markup schema, including schemas which have nothing to do\n        with the TEI at all. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.26.10\">Equally, it is possible to construct a TEI Schema which is identical to that derived from a\n        given TEI ODD file without using the ODD schema. A schema can constructed simply by\n        combining the predefined schema language fragments corresponding with the required set of\n        TEI modules and other statements in the relevant schema language. However, the status of\n        such a schema with respect to the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.26.10.2\"><a href=\"/ref/tei_all\">tei_all</a></span> schema cannot in\n        general be easily determined; it may therefore be impractical to determine whether such a\n        schema represents a clean modification or an extension. This is one reason for making the\n        presence of a TEI ODD file a requirement for conformance. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.18.28\" id=\"CFCATSCH\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.18.28.4\">23.4.6 Varieties of TEI Conformance</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.6\">The conformance status of a given document may be assessed by answering the following\n        questions, in the order indicated: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.18.28.6.2\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.3\">Is it a valid XML document, for which a TEI Schema exists? If not, then the document\n            cannot be considered TEI-conformant in any sense.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.5\">Is the document accompanied by a TEI-conformant ODD specification describing its\n            markup schema and intended semantics? If not, then the document can only be considered\n            TEI-conformant if it validates against a predefined TEI Schema and conforms to the TEI\n            abstract model.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.7\">Does the markup in the document correctly represent the TEI abstract model? Though\n            difficult to assess, this is essential to TEI conformance.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.9\">Does the document claim that all of its elements come from some namespace other than\n            the TEI (or no namespace)? If so, the document cannot be TEI-conformant.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.11\">If the document claims to use the TEI namespace, in part or wholly, do the elements\n            associated with that namespace in fact belong to it? If not, the document cannot be\n            TEI-conformant; if so, and if all non-TEI elements and attributes are correctly\n            associated with other namespaces, then the document may be TEI-conformant.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.13\">Is the document valid according to a schema made by combining all TEI modules as\n            well as valid according to the schema derived from its associated ODD specification? If\n            so, the document is TEI-conformant. </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.15\">Is the document valid according to the schema derived from its associated ODD\n            specification, but not according to <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.6.2.15.2\"><a href=\"/ref/tei_all\">tei_all</a></span>? If so, the\n            document uses a TEI extension. </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.18.28.6.2.17\">Is it possible automatically to transform the document into a document which is\n            valid according to <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.6.2.17.2\"><a href=\"/ref/tei_all\">tei_all</a></span>, using only information supplied\n            in the accompanying ODD and without loss of information? If so, the document is\n            TEI-conformant.</li>\n</ol>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.8\">In the following table, we examine more closely some specific, though imaginary, cases:\n          <table class=\"tei-table\" data-tei=\"1.7.4.46.18.28.8.2\" id=\"tab-conformance\">\n<tr class=\"tei-row1\" data-tei=\"1.7.4.46.18.28.8.2.3\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.3\"></td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.5\">A</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.7\">B </td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.9\">C</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.11\">D</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.13\">E </td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.15\">F</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.17\">G</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.3.19\">H</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.4.46.18.28.8.2.5\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.2\">Conforms to TEI Abstract Model</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.4\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.6\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.8\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.10\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.12\">?</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.14\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.16\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.5.18\">?</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.4.46.18.28.8.2.7\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.2\">Valid ODD present</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.4\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.6\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.8\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.10\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.12\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.14\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.16\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.7.18\">N</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.4.46.18.28.8.2.9\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.2\">Uses only non-TEI namespace(s) or none</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.4\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.6\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.8\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.10\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.12\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.14\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.16\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.9.18\">N</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.4.46.18.28.8.2.11\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.2\">Uses TEI and other namespaces correctly</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.4\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.6\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.8\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.10\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.12\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.14\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.16\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.11.18\">Y</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.4.46.18.28.8.2.13\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.2\">Document is valid as a subset of <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.8.2.13.2.2\"><a href=\"/ref/tei_all\">tei_all</a></span></td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.4\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.6\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.8\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.10\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.12\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.14\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.16\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.13.18\">Y</td>\n</tr>\n<tr class=\"tei-row2\" data-tei=\"1.7.4.46.18.28.8.2.15\">\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.2\">Document can be converted automatically to a form which is valid as a subset of\n                <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.8.2.15.2.2\"><a href=\"/ref/tei_all\">tei_all</a></span></td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.4\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.6\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.8\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.10\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.12\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.14\">Y</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.16\">N</td>\n<td class=\"tei-cell\" data-tei=\"1.7.4.46.18.28.8.2.15.18\">?</td>\n</tr>\n</table>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.10\">We assume firstly that each sample document assessed here is a well-formed XML document,\n        and that it is valid against some schema. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.12\">The document in column A is TEI-conformant. Its tagging follows the TEI Abstract Model,\n        both as regards syntactic constraints (its <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.12.2\" href=\"/ref/l\" target=\"\">l</a> elements appear within <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.12.4\" href=\"/ref/div\" target=\"\">div</a>\n        elements and not the reverse) and semantic constraints (its <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.12.6\" href=\"/ref/l\" target=\"\">l</a> elements appear to\n        contain verse lines rather than typographic ones). It is accompanied by a valid ODD which\n        documents exactly how it uses the TEI. All the TEI-defined elements and attributes in the\n        document are placed in the TEI namespace. The schema against which it is valid is a\n          clean subset of the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.12.10\"><a href=\"/ref/tei_all\">tei_all</a></span> schema. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.14\">The document in column B is not a TEI document. Although it is accompanied by a valid TEI\n        ODD, the resulting schema includes some unclean modifications, and\n        represents some concepts from the TEI Abstract Model using non-TEI elements; for example, it\n        re-defines the content model of <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.14.4\" href=\"/ref/p\" target=\"\">p</a> to permit <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.14.6\" href=\"/ref/div\" target=\"\">div</a> within it, and it includes\n        an element <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.14.8\" href=\"/ref/pageTrimming\" target=\"\">pageTrimming</a> which appears to have the same meaning\n        as the existing TEI <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.14.10\" href=\"/ref/fw\" target=\"\">fw</a> element, but the equivalence is not made explicit in the\n        ODD. It uses the TEI namespace correctly to identify the TEI elements it contains, but the\n        ODD does not contain enough information automatically to convert its non-TEI elements into\n        TEI equivalents.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.16\">The document in column C is  TEI conformant. It is almost the same as\n        the document in column A, except that the names of the elements used are not those specified\n        for the TEI namespace. Because the ODD accompanying it contains an exact mapping for each\n        element name (using the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.16.4\" href=\"/ref/altIdent\" target=\"\">altIdent</a> element) and there are no name conflicts, it is\n        possible to make an automatic conversion of this document.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.18\">The document in column D is a TEI Extension. It combines elements from its own namespace\n        with unmodified TEI elements in the TEI namespace. Its usage of TEI elements conforms to the\n        TEI Abstract Model. Its ODD defines a new <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.18.2\" href=\"/ref/blort\" target=\"\">blort</a> element which\n        has no exact TEI equivalent, but which is assigned to an existing TEI class; consequently\n        its schema is not a clean subset of <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.18.4\"><a href=\"/ref/tei_all\">tei_all</a></span>. If the associated\n        ODD provided a way of mapping this element to an existing TEI element, then this would be\n        TEI-conformant.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.20\">The document in column E is superficially similar to document D, but because it does not\n        use any namespace declarations (or, equivalently, it assigns unmodified TEI elements to its\n        own namespace), it may contain name collisions; there is no way of knowing whether a\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.20.2\" href=\"/ref/p\" target=\"\">p</a> within it is the same as the TEI's <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.20.4\" href=\"/ref/p\" target=\"\">p</a> or has some other meaning. The\n        accompanying ODD file may be used to provide the human reader with information about\n        equivalently named elements in the TEI namespace, and hence to determine whether the\n        document is valid with respect to the TEI Abstract Model but this is not an automatable\n        process. In particular, cases of apparent conflict (for example use of an element <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.20.6\" href=\"/ref/p\" target=\"\">p</a>\n        to represent a concept not in the TEI Abstract Model but in the abstract model of some other\n        system, whose namespace has been removed as well) cannot be reliably resolved. By our\n        current definition therefore, this is not a TEI document.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.22\">The document in column F is TEI-conformant. The difference between it and that in\n        column D is that the new element <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.22.4\" href=\"/ref/blort\" target=\"\">blort</a> which is used in this\n        document is a specialization of an existing TEI element, and the ODD in which it is defined\n        specifies the mapping (a <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.22.6\" href=\"/ref/my:blort\" target=\"\">my:blort</a> may be automatically converted\n        to a tei:seg type=\"blort\", for example). For this to work, however, the <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.22.10\" href=\"/ref/blort\" target=\"\">blort</a> must observe the same syntactic constraints as the\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.18.28.22.12\" href=\"/ref/seg\" target=\"\">seg</a>; if it does not, this would also be a case of TEI Extension.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.24\">The document in column G is not a TEI document. Its structure is fully documented by a\n        valid TEI ODD, but it does not claim to represent the TEI Abstract Model, does not use the\n        TEI namespace, and is not intended to validate against any TEI schema. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.18.28.26\">The document in column H is very like that in column A, but it lacks an accompanying ODD.\n        Instead, the schema used to validate it is produced simply by combining TEI schema fragments\n        in the same way as an ODD processor would, given the ODD. If the resulting schema is a clean\n        subset of <span class=\"tei-ident1\" data-tei=\"1.7.4.46.18.28.26.2\"><a href=\"/ref/tei_all\">tei_all</a></span>, such a document is indistinguishable from a\n        TEI-conformant one, but there is no way of determining (without inspection) whether this is\n        the case if any modification or extension has been applied. Its status is therefore, like\n        that of Text E, impossible to determine.</p>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20\" id=\"IM\">\n<h2 class=\"tei-head9\" data-tei=\"1.7.4.46.20.4\">23.5 Implementation of an ODD System</h2>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.6\">This section specifies how a processing system may take advantage of the markup specification\n      elements documented in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.6.2\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link> of these Guidelines in order to produce\n      project specific user documentation, schemas in one or more schema languages, and validation\n      tools for other processors.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.8\">The specifications in this section are illustrative but not normative. Its function is to\n      further illustrate the intended scope and application of the elements documented in chapter\n        <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.8.2\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>, since it is believed that these may have application beyond the areas\n      directly addressed by the TEI.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.10\">An ODD processing system has to accomplish two main tasks. A set of selections, deletions,\n      changes, and additions supplied by an ODD customization (as described in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.10.2\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>)\n      must first be merged with the published TEI P5 ODD specifications. Next, the resulting unified\n      ODD must be processed to produce the desired outputs.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.12\">An ODD processor is not required to do these two stages in sequence, but that may well be the\n      simplest approach; the ODD processing tools currently provided by the TEI Consortium, which\n      are also used to process the source of these Guidelines, adopt this approach.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.14\" id=\"IM-unified\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.14.3\">23.5.1 Making a Unified ODD</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.5\">An ODD customization must contain a single <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.5.2\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> element, which defines the\n        schema to be constructed. <ul class=\"tei-specList specList\" data-tei=\"1.7.4.46.20.14.5.4\">\n<li class=\"tei-specDesc specDesc\" data-tei=\"1.7.4.46.20.14.5.4.2\"><span><span class=\"element\">&lt;<a href=\"/ref/schemaSpec\">schemaSpec</a>&gt; </span><span><span class=\"tei-desc2\" data-tei=\"1.7.4.44.21.18.14.15\">generates a TEI-conformant schema and documentation for it.</span></span></span></li>\n</ul> Amongst other attributes inherited from the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.5.6\"><a href=\"/ref/att.identified\">att.identified</a></span> class, this element also carries a required ident\n        attribute. This provides a name for the generated schema, which other components of the\n        processing system may use to refer to the schema being generated, e.g. in issuing error\n        messages or as part of the generated output schema file or files. The ns\n        attribute may be used to specify the default namespace within which elements valid against\n        the resulting schema belong, as discussed in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.14.5.12\" emit=\"transcription\" hash=\"MDNS\" xml-id=\"MDNS\">23.3.2 Modification and Namespaces</pb-link>. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.7\">The <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.2\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> element contains an unordered series of specialized elements, each\n        of which is of one of the following four types: <dl class=\"tei-list3\" data-tei=\"1.7.4.46.20.14.7.4\"><dt data-tei=\"1.7.4.46.20.14.7.4.5\"><span class=\"tei-label\" data-tei=\"1.7.4.46.20.14.7.4.3\">specifications</span></dt><dd data-tei=\"1.7.4.46.20.14.7.4.5\">elements from the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.7.4.5.2\"><a href=\"/ref/model.oddDecl\">model.oddDecl</a></span> (by default\n              <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.5.4\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.5.6\" href=\"/ref/classSpec\" target=\"\">classSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.5.8\" href=\"/ref/moduleSpec\" target=\"\">moduleSpec</a>, and\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.5.10\" href=\"/ref/macroSpec\" target=\"\">macroSpec</a>); these must have a mode attribute which determines how\n            they will be processed.<a class=\"note tei-note\" data-tei=\"1.7.4.46.20.14.7.4.5.14\" href=\"#fn_1_7_4_46_20_14_7_4_5_14\" id=\"fnref_1_7_4_46_20_14_7_4_5_14\" rel=\"footnote\">6</a> If the value of mode is add, then\n            the object is simply copied to the output, but if it is change,\n              delete, or replace, then it will be looked at by other parts of\n            the process.</dd><dt data-tei=\"1.7.4.46.20.14.7.4.9\"><span class=\"tei-label\" data-tei=\"1.7.4.46.20.14.7.4.7\">references to specifications</span></dt><dd data-tei=\"1.7.4.46.20.14.7.4.9\"><a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.1\" href=\"/ref/specGrpRef\" target=\"\">specGrpRef</a> elements refer to <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.3\" href=\"/ref/specGrp\" target=\"\">specGrp</a> elements that occur elsewhere\n            in this, or another, document. A <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.5\" href=\"/ref/specGrp\" target=\"\">specGrp</a> element, in turn, groups together a\n            set of ODD specifications (among other things, including further <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.7\" href=\"/ref/specGrpRef\" target=\"\">specGrpRef</a>\n            elements). The use of <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.9\" href=\"/ref/specGrp\" target=\"\">specGrp</a> and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.11\" href=\"/ref/specGrpRef\" target=\"\">specGrpRef</a> permits the ODD markup to\n            occur at the points in documentation where they are discussed, rather than all inside\n              <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.13\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a>. The target attribute of any <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.17\" href=\"/ref/specGrpRef\" target=\"\">specGrpRef</a> should\n            be followed, and the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.19\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.21\" href=\"/ref/classSpec\" target=\"\">classSpec</a>, and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.23\" href=\"/ref/macroSpec\" target=\"\">macroSpec</a>,\n            elements in the corresponding <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.25\" href=\"/ref/specGrp\" target=\"\">specGrp</a> should be processed as described in the\n            previous item; <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.9.27\" href=\"/ref/specGrpRef\" target=\"\">specGrpRef</a> elements should be processed as described\n            here.</dd><dt data-tei=\"1.7.4.46.20.14.7.4.13\"><span class=\"tei-label\" data-tei=\"1.7.4.46.20.14.7.4.11\">references to TEI Modules</span></dt><dd data-tei=\"1.7.4.46.20.14.7.4.13\"><a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.13.1\" href=\"/ref/moduleRef\" target=\"\">moduleRef</a> elements with key attributes refer to components of\n            the TEI. The value of the key attribute matches the ident\n            attribute of the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.13.9\" href=\"/ref/moduleSpec\" target=\"\">moduleSpec</a> element defining a TEI module. The key\n            must be dereferenced by some means, such as reading an XML file with the TEI ODD\n            specification (either from the local hard drive or off the Web), or looking up the\n            reference in an XML database (again, locally or remotely); whatever means is used, it\n            should return a stream of XML containing the element, class, and macro specifications\n            collected together in the specified module. These specification elements are then\n            processed in the same way as if they had been supplied directly within the\n              <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.13.13\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> being processed.</dd><dt data-tei=\"1.7.4.46.20.14.7.4.17\"><span class=\"tei-label\" data-tei=\"1.7.4.46.20.14.7.4.15\">references to external modules</span></dt><dd data-tei=\"1.7.4.46.20.14.7.4.17\">a <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.7.4.17.2\" href=\"/ref/moduleRef\" target=\"\">moduleRef</a> element may also refer to a compatible external module by means\n            of its url attribute; the content of such modules, which must be available in\n            the RELAX NG XML syntax, are passed directly and without modification to the output\n            schema when that is created. </dd></dl>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.9\">Each object obtained from the TEI ODD specification using <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.9.2\" href=\"/ref/moduleRef\" target=\"\">moduleRef</a> by means of\n        the key attribute must be checked against objects in the customization\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.9.6\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> according to the following rules: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.20.14.9.8\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.9.8.3\">if there is an object in the ODD customization with the same value for the\n              ident attribute, and a mode value of delete, then the\n            object from the module is ignored; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.9.8.5\">if there is an object in the ODD customization with the same value for the\n              ident attribute, and a mode value of replace, then\n            the object from the module is ignored, and the one from the ODD customization is used in\n            its place; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.9.8.7\">if there is an object in the ODD customization with the same value for the\n              ident attribute, and a mode value of change, then the\n            two objects must be merged, as described below; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.9.8.9\">if there is an object in the ODD customization with the same value for the\n              ident attribute, and a mode value of add, then an\n            error condition should be raised; </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.9.8.11\">otherwise, the object from the module is copied to the result.</li>\n</ol>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.11\">To merge two objects with the same ident, their component attributes and child\n        elements must be looked at recursively. Each component may fall into one of the following\n        four categories: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.20.14.11.4\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.11.4.3\">Some components may occur only once within the merged object (for example\n            attributes, and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.3.2\" href=\"/ref/altIdent\" target=\"\">altIdent</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.3.4\" href=\"/ref/content\" target=\"\">content</a>, or <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.3.6\" href=\"/ref/classes\" target=\"\">classes</a> elements). If\n            such a component is found in the ODD customization, it will be copied to the output; if\n            it is not found there, but is present in the TEI ODD specification, then that will be\n            copied to the output. </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.11.4.5\">Some components are grouping objects (<a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.5.2\" href=\"/ref/attList\" target=\"\">attList</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.5.4\" href=\"/ref/valList\" target=\"\">valList</a>, for\n            example); these are always copied to the output, and their children are then processed\n            following the rules given in this list.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.11.4.7\">Some components are identifiable: this means that they are\n            members of the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.11.4.7.4\"><a href=\"/ref/att.identified\">att.identified</a></span> class from which they inherit\n            the ident attribute; examples include <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.7.8\" href=\"/ref/attDef\" target=\"\">attDef</a> and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.7.10\" href=\"/ref/valItem\" target=\"\">valItem</a>. A\n            component of this type will be processed according to its mode attribute,\n            following the rules given above.</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.14.11.4.9\">Some components may occur multiple times, but are neither grouped nor identifiable.\n            Examples include the members of <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.11.4.9.2\"><a href=\"/ref/model.glossLike\">model.glossLike</a></span> such as\n              <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.4\" href=\"/ref/equiv\" target=\"\">equiv</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.6\" href=\"/ref/desc\" target=\"\">desc</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.8\" href=\"/ref/gloss\" target=\"\">gloss</a>, the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.10\" href=\"/ref/exemplum\" target=\"\">exemplum</a>,\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.12\" href=\"/ref/remarks\" target=\"\">remarks</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.14\" href=\"/ref/listRef\" target=\"\">listRef</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.16\" href=\"/ref/datatype\" target=\"\">datatype</a> or <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.11.4.9.18\" href=\"/ref/defaultVal\" target=\"\">defaultVal</a> elements.\n            These should be copied from both the TEI ODD specification and the ODD customization,\n            and all occurrences included in the output.</li>\n</ol>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.13\">A special problem arises with elements which are members of attribute classes, as they are\n        permitted to override attributes inherited from a class. For example, consider this simple\n        modification: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.14.13.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"p\"&gt;\n            &lt;classes&gt;\n              &lt;memberOf key=\"att.typed\"/&gt;\n            &lt;/classes&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> The effect of its membership in the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.13.4\"><a href=\"/ref/att.typed\">att.typed</a></span> class is\n        to provide <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.13.6\" href=\"/ref/p\" target=\"\">p</a> with a type attribute and a subtype attribute.\n        If we wish <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.13.12\" href=\"/ref/p\" target=\"\">p</a> to not have subtype, we could extend the\n        customization in our schema as follows: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.14.13.18\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"p\"&gt;\n            &lt;classes&gt;\n              &lt;memberOf key=\"att.typed\"/&gt;\n            &lt;/classes&gt;\n            &lt;!-- ... --&gt;\n            &lt;attList&gt;\n              &lt;attDef ident=\"subtype\" mode=\"delete\"/&gt;\n            &lt;/attList&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> This means that when memberOf key=\"att.typed\"/ is processed, that class\n        is looked up, each attribute which it defines is examined in turn, and the customization is\n        searched for an override. If the modification is of the attribute class itself, work\n        proceeds as usual; if, however, the modification is at the element level, the class\n        reference is deleted and a series of <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.13.22\" href=\"/ref/attRef\" target=\"\">attRef</a> elements is added to the element, one\n        for each attribute inherited from the class. Since attribute classes can themselves be\n        members of other attribute classes, membership must be followed recursively.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.15\">The effect of the concatenation of unidentifiable components should be considered\n        carefully. An original may have <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.14.15.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"p\"&gt;\n            &lt;desc&gt;marks paragraphs in prose.&lt;/desc&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> which would usefully be extended with this: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.14.15.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"p\" mode=\"change\"&gt;\n            &lt;desc xml:lang=\"es\"&gt;marca prrafos en prosa.&lt;/desc&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> to provide an alternate description in another language. Nothing prevents the user\n        from supplying <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.15.6\" href=\"/ref/desc\" target=\"\">desc</a> several times in the same language, and subsequent applications\n        will have to decide what that may mean.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.17\">Similar considerations apply to multiple example elements, though these are less likely to\n        cause problems in documentation. Note that existing examples can only be deleted by\n        supplying a completely new <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.17.2\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> in replace mode, since the\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.17.6\" href=\"/ref/exemplum\" target=\"\">exemplum</a> element is not identifiable.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.19\">In the processing of the content models of elements and the content of macros, deleted\n        elements may require special attention.<a class=\"note tei-note\" data-tei=\"1.7.4.46.20.14.19.2\" href=\"#fn_1_7_4_46_20_14_19_2\" id=\"fnref_1_7_4_46_20_14_19_2\" rel=\"footnote\">7</a> A content model like this: \n        <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.14.19.6\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"person\"&gt;\n            &lt;!-- ... --&gt;\n            &lt;content&gt;\n              &lt;alternate&gt;\n                &lt;classRef key=\"model.pLike\" minOccurs=\"1\" maxOccurs=\"unbounded\"/&gt;\n                &lt;alternate minOccurs=\"0\" maxOccurs=\"unbounded\"&gt;\n                  &lt;classRef key=\"model.personPart\"/&gt;\n                  &lt;classRef key=\"model.global\"/&gt;\n                &lt;/alternate&gt;\n              &lt;/alternate&gt;\n            &lt;/content&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> requires no special treatment because everything is expressed in terms of model\n        classes; if the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.19.8\"><a href=\"/ref/model.personPart\">model.personPart</a></span> is deleted explicitly, or\n        removed because all of its members have been deleted, then <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.19.10\"><a href=\"/ref/model.global\">model.global</a></span> is left as the only child of the inner <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.19.12\" href=\"/ref/alternate\" target=\"\">alternate</a>. An ODD\n        processor may or may not elect to simplify the resulting choice between nothing and <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.14.19.14\"><a href=\"/ref/model.global\">model.global</a></span> by removing the wrapper <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.19.16\" href=\"/ref/alternate\" target=\"\">alternate</a> element.\n        However, such simplification may be considerably more complex in the general case\n        and\n        an ODD processor is therefore likely to be more successful in carrying out such\n        simplification as a distinct stage during processing of ODD sources.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.21\">If an element refers directly to an element child, like this: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.14.21.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"figure\"&gt;\n            &lt;!-- ... --&gt;\n            &lt;content&gt;\n              &lt;alternate minOccurs=\"0\" maxOccurs=\"unbounded\"&gt;\n                &lt;classRef key=\"model.pLike\"/&gt;\n                &lt;classRef key=\"model.global\"/&gt;\n                &lt;elementRef key=\"figure\"/&gt;\n                &lt;elementRef key=\"figDesc\"/&gt;\n                &lt;classRef key=\"model.graphicLike\"/&gt;\n                &lt;classRef key=\"model.headLike\"/&gt;\n              &lt;/alternate&gt;\n            &lt;/content&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.21.4\" href=\"/ref/figDesc\" target=\"\">figDesc</a> has been deleted,<a class=\"note tei-note\" data-tei=\"1.7.4.46.20.14.21.6\" href=\"#fn_1_7_4_46_20_14_21_6\" id=\"fnref_1_7_4_46_20_14_21_6\" rel=\"footnote\">8</a> it will be\n        necessary to remove that reference, or the resulting schema will be\n        invalid.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.14.23\">The result of the work carried out should be a new <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.23.2\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> which contains a\n        complete and internally consistent set of element, class, and macro specifications, possibly\n        also including <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.14.23.4\" href=\"/ref/moduleRef\" target=\"\">moduleRef</a> elements with url attributes identifying\n        external modules. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.16\" id=\"IMGS\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.16.3\">23.5.2 Generating Schemas</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.5\">Assuming that any modifications have been resolved, as outlined in the previous section,\n        making a schema is now a four stage process: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.20.16.5.2\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.5.2.3\">all datatype and other macro specifications must be collected together and declared\n            at the start of the output schema;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.5.2.5\"> all classes must be declared in the right order (order is significant because since\n            some classes reference others);</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.5.2.7\">all elements are declared;</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.5.2.9\">any <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.16.5.2.9.2\" href=\"/ref/moduleRef\" target=\"\">moduleRef</a> elements with a url attribute identifying an\n            external schema must be processed.</li>\n</ol> Working in this order gives the best chance of successfully supporting all the\n        schema languages. However, there are a number of obstacles to overcome along the way.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.7\">An ODD processor may choose to use any desired schema language or languages for its schema\n        output, since ODD specifications are expressed as far as possible in a form independent of\n        any schema language.\n        \n        The current TEI ODD processing system produces schema output in the three main schema\n        languages as follows: <ul class=\"tei-list3 bulleted\" data-tei=\"1.7.4.46.20.16.7.4\"><li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.7.4.3\">A RELAX NG (XML) schema is generated by converting content models, datatypes, and\n            macro specifications provided within the ODD specification; a version re-expressed in\n            the RELAX NG compact syntax is generated using James Clark's <span class=\"tei-name\" data-tei=\"1.7.4.46.20.16.7.4.3.2\">trang</span>\n            application.</li><li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.7.4.5\">A DTD schema is generated by converting the RELAX NG content models to DTD language,\n            often simplifying it to allow for the less-sophisticated output language.</li><li class=\"tei-item\" data-tei=\"1.7.4.46.20.16.7.4.7\">A W3C Schema schema is created by generating a RELAX NG schema and then using James\n            Clark's <span class=\"tei-name\" data-tei=\"1.7.4.46.20.16.7.4.7.2\">trang</span> application.</li></ul> Note that the method used to generate W3C Schema means that a processor must ensure\n        that the RELAX NG it generates follows the subset which <span class=\"tei-name\" data-tei=\"1.7.4.46.20.16.7.6\">trang</span> is able to\n        translate properly (see further below)this may involve simple trial and error.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.9\">Other projects may decide to follow a different route, perhaps implementing a direct ODD to\n        W3C Schema translator.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.11\">Secondly, it is possible to create two rather different styles of schema. On the one hand,\n        the schema can try to maintain all the flexibility of ODD by using the facilities of the\n        schema language for parameterization; on the other, it can remove all customization features\n        and produce a flat result which is not suitable for further manipulation. The TEI project\n        currently generates both styles of schema; the first as a set of schema fragments in DTD and\n        RELAX NG languages, which can be included as modules in other schemas, and customized\n        further; the second as the output from a processor such as Roma, in which many of the\n        parameterization features have been removed.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.13\">The difference between the schema styles may be illustrated by considering this ODD\n        specification: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.16.13.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec module=\"drama\" ident=\"performance\"&gt;\n            &lt;!-- ... --&gt;\n            &lt;classes&gt;\n              &lt;memberOf key=\"model.frontPart.drama\"/&gt;\n            &lt;/classes&gt;\n            &lt;content&gt;\n              &lt;sequence&gt;\n                &lt;alternate minOccurs=\"0\" maxOccurs=\"unbounded\"&gt;\n                  &lt;classRef key=\"model.divTop\"/&gt;\n                  &lt;classRef key=\"model.global\"/&gt;\n                &lt;/alternate&gt;\n                &lt;sequence minOccurs=\"1\" maxOccurs=\"unbounded\"&gt;\n                  &lt;classRef key=\"model.common\"/&gt;\n                  &lt;classRef key=\"model.global\" minOccurs=\"0\" maxOccurs=\"unbounded\"/&gt;\n                &lt;/sequence&gt;\n                &lt;sequence minOccurs=\"0\" maxOccurs=\"unbounded\"&gt;\n                  &lt;classRef key=\"model.divBottom\"/&gt;\n                  &lt;classRef key=\"model.global\" minOccurs=\"0\" maxOccurs=\"unbounded\"/&gt;\n                &lt;/sequence&gt;\n              &lt;/sequence&gt;\n            &lt;/content&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> A simple rendering to RELAX NG produces this:\n        <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.16.13.4\"><pb-code-highlight theme=\"solarizedlight\"><template>performance =\n element performance { \n  (model.divTop | model.global)*,\n  (model.common, model.global*)+,\n  (model.divBottom, model.global*)*\n  att.global.attribute.xmlspace,\n  att.global.attribute.xmlid,\n  att.global.attribute.n,\n  att.global.attribute.xmllang,\n  att.global.attribute.rend,\n  att.global.attribute.xmlbase,\n  att.global.linking.attribute.corresp,\n  att.global.linking.attribute.synch,\n  att.global.linking.attribute.sameAs,\n  att.global.linking.attribute.copyOf,\n  att.global.linking.attribute.next,\n  att.global.linking.attribute.prev,\n  att.global.linking.attribute.exclude,\n  att.global.linking.attribute.select\n}</template></pb-code-highlight></div> In the above, a subsequent redefinition of the attribute class (such as <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.16.13.6\"><a href=\"/ref/att.global\">att.global</a></span>) would have no effect, since references to such classes have been\n        expanded to reference their constituent attributes.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.15\"> The equivalent parameterized version might look like this:\n        <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.16.15.2\"><pb-code-highlight theme=\"solarizedlight\"><template>performance =\n  element performance { performance.content, performance.attributes }\nperformance.content =\n  (model.divTop | model.global)*,\n  (model.common, model.global*)+,\n  (model.divBottom, model.global*)*\nperformance.attributes = att.global.attributes, empty</template></pb-code-highlight></div> Here, the attribute class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.16.15.4\"><a href=\"/ref/att.global\">att.global</a></span> is provided via an\n        explicit reference (<span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.16.15.6\">att.global.attributes</span>), and can therefore be redefined.\n        Moreover, the attributes are separated from the content model, allowing either to be\n        overridden.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.17\">In the remainder of these section, the terms <span class=\"tei-term\" data-tei=\"1.7.4.46.20.16.17.2\">simple schema</span> and\n          <span class=\"tei-term\" data-tei=\"1.7.4.46.20.16.17.4\">parameterized schema</span> are used to distinguish the two schema types. An ODD\n        processor is not required to support both, though the simple schema output is generally\n        preferable for most applications.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.19\">Thirdly, the problem of missing components must be resolved. For example, consider this\n        (fictitious) model for <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.16.19.2\" href=\"/ref/sp\" target=\"\">sp</a>: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.16.19.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"sp\"&gt;\n            &lt;!-- ... --&gt;\n            &lt;content&gt;\n              &lt;classRef key=\"model.global\" minOccurs=\"0\" maxOccurs=\"unbounded\"/&gt;\n              &lt;sequence minOccurs=\"0\" maxOccurs=\"1\"&gt;\n                &lt;elementRef key=\"speaker\"/&gt;\n                &lt;classRef key=\"model.global\" minOccurs=\"0\" maxOccurs=\"unbounded\"/&gt;\n              &lt;/sequence&gt;\n            &lt;/content&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> This proposes anything from the class <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.16.19.6\"><a href=\"/ref/model.global\">model.global</a></span>,\n        followed optionally by a <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.16.19.8\" href=\"/ref/speaker\" target=\"\">speaker</a> element followed by anything from the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.16.19.10\"><a href=\"/ref/model.global\">model.global</a></span> class. What happens if <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.16.19.12\" href=\"/ref/speaker\" target=\"\">speaker</a> is removed from\n        the schema? The following would result: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.16.19.14\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec ident=\"sp\"&gt;\n            &lt;!-- ... --&gt;\n            &lt;content&gt;\n              &lt;classRef key=\"model.global\" minOccurs=\"0\" maxOccurs=\"unbounded\"/&gt;\n              &lt;classRef key=\"model.global\" minOccurs=\"0\" maxOccurs=\"unbounded\"/&gt;\n            &lt;/content&gt;\n            &lt;!-- ... --&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> which is illegal in DTD and W3C schema languages, since for a given member of\n          <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.16.19.16\"><a href=\"/ref/model.global\">model.global</a></span> it is impossible to be sure which rule is being\n        used. This situation is not detected when RELAX NG is used, since the language is able to\n        cope with non-deterministic content models of this kind and does not require that only a\n        single rule be used. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.23\">Finally, an application will need to have some method of associating the schema with\n        document instances that use it. The TEI does not mandate any particular method of doing\n        this, since different schema languages and processors vary considerably in their\n        requirements. ODD processors may wish to build in support for some of the methods for\n        associating a document instance with a schema. The TEI does not mandate any particular\n        method, but does suggest that those which are already part of XML (the DOCTYPE declaration\n        for DTDs) and W3C Schema (the xsi:schemaLocation attribute) be supported where\n        possible.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.25\">In order for the xsi:schemaLocation attribute to be valid when a document is\n        validated against either a DTD or a RELAX NG schema, ODD processors may wish to add\n        declarations for this attribute and its namespace to the root element, even though these are\n        not part of the TEI <span class=\"tei-foreign\" data-tei=\"1.7.4.46.20.16.25.4\">per se</span>. For DTDs this means adding <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.16.25.6\"><pb-code-highlight theme=\"solarizedlight\"><template>xsi:schemaLocation CDATA #IMPLIED xmlns:xsi CDATA #FIXED\n'http://www.w3.org/2001/XMLSchema-instance'</template></pb-code-highlight></div> to the list of attributes on the root element,\n        which permits the non-namespace-aware DTD language to recognize the\n          <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.16.25.8\">xsi:schemaLocation</span> notation. For RELAX NG, the namespace and attribute would\n        be declared in the usual way: <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.16.25.10\"><pb-code-highlight theme=\"solarizedlight\"><template>namespace xsi =\n\"http://www.w3.org/2001/XMLSchema-instance\"</template></pb-code-highlight></div> and <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.16.25.12\"><pb-code-highlight theme=\"solarizedlight\"><template>attribute\nxsi:schemaLocation { list { teidata.namespace, teidata.pointer }+ }</template></pb-code-highlight></div> inside the root element\n        declaration.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.27\">Note that declaration of the xsi:schemaLocation attribute in a W3C Schema schema\n        is not permitted. Therefore, if W3C Schemas are being generated by converting the RELAX NG\n        schema (for example, with <span class=\"tei-name\" data-tei=\"1.7.4.46.20.16.27.4\">trang</span>), it may be necessary to perform that\n        conversion prior to adding the xsi:schemaLocation declaration to the RELAX\n        NG.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.16.29\">It is recognized that this is an unsatisfactory solution, but it permits users to take\n        advantage of the W3C Schema facility for indicating a schema, while still permitting\n        documents to be validated using DTD and RELAX NG processors without any conflict.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.18\" id=\"IM-naming\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.18.3\">23.5.3 Names and Documentation in Generated Schemas</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.18.5\">When processing class, element, or macro specifications, there are three general rules:\n          <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.20.18.5.2\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.18.5.2.3\">If a RELAX NG pattern or DTD parameter entity is being created, its name is the\n            value of the corresponding ident attribute, prefixed by the value of any\n              prefix attribute on <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.18.5.2.3.6\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a>. This allows for elements from an\n            external schema to be mixed in without risk of name clashes, since all TEI elements can\n            be given a distinctive prefix such as tei_. Thus <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.18.5.2.3.10\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n              &lt;schemaSpec ident=\"test\" prefix=\"tei_\"&gt;\n                &lt;elementSpec ident=\"sp\"&gt;\n                  &lt;!--...--&gt;\n                &lt;/elementSpec&gt;\n              &lt;/schemaSpec&gt;\n            </pb-code-highlight></div> may generate a RELAX NG (compact syntax) pattern like this:\n            <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.18.5.2.3.12\"><pb-code-highlight theme=\"solarizedlight\"><template> tei_sp = element sp { ... }</template></pb-code-highlight></div> References to these patterns (or, in DTDs, parameter entities) also need to be prefixed\n            with the same value. </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.18.5.2.5\">If an element or attribute is being created, its default name is the value of the\n              ident attribute, but if there is an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.18.5.2.5.4\" href=\"/ref/altIdent\" target=\"\">altIdent</a> child, its content is\n            used instead. </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.18.5.2.7\">Where appropriate, the documentation strings in <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.18.5.2.7.2\" href=\"/ref/gloss\" target=\"\">gloss</a> and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.18.5.2.7.4\" href=\"/ref/desc\" target=\"\">desc</a>\n            should be copied into the generated schema. If there is only one occurrence of either of\n            these elements, it should be used regardless, but if there are several, local processing\n            rules will need to be applied. For example, if there are several with different values\n            of xml:lang, a locale indication in the processing environment might be used\n            to decide which to use. For example, <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.18.5.2.7.8\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n              &lt;elementSpec module=\"core\" ident=\"head\"&gt;\n                &lt;equiv/&gt;\n                &lt;gloss&gt;heading&lt;/gloss&gt;\n                &lt;gloss xml:lang=\"fr\"&gt;en-tte&lt;/gloss&gt;\n                &lt;gloss xml:lang=\"es\"&gt;encabezamiento&lt;/gloss&gt;\n                &lt;gloss xml:lang=\"it\"&gt;titolo&lt;/gloss&gt;\n                &lt;!-- ... --&gt;\n              &lt;/elementSpec&gt;\n            </pb-code-highlight></div><pb-popover class=\"alternate tei-ex_egXML2 bibl-link\" data-tei=\"1.7.4.46.20.18.5.2.7.8\" id=\"altref_1\"><span slot=\"default\">bibliography</span><template slot=\"alternate\">Example is copied from the source of these <span class=\"tei-title4\" data-tei=\"1.7.6.12.5.4.672.3\">Guidelines</span>.</template></pb-popover> might generate a RELAX NG schema fragment like the following, if the locale is\n            determined to be French: <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.18.5.2.7.10\"><pb-code-highlight theme=\"solarizedlight\"><template>head =\n  ## en-tte\n  element head { head.content, head.attributes }</template></pb-code-highlight></div>\n</li>\n</ol> Alternatively, a selection might be made on the basis of the value of the\n          version attribute which these elements carry as members of the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.18.5.6\"><a href=\"/ref/att.translatable\">att.translatable</a></span> class. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.18.7\">In addition, there are three conventions about naming patterns relating to classes; ODD\n        processors need not follow them, but those reading the schemas generated by the TEI project\n        will find it necessary to understand them: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.20.18.7.2\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.18.7.2.3\">when a pattern for an attribute class is created, it is named after the attribute\n            class identifier (as above) suffixed by <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.18.7.2.3.2\">.attributes</span> (e.g.\n              <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.18.7.2.3.4\">att.editLike.attributes</span>); </li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.18.7.2.5\">when a pattern for an attribute is created, it is named after the attribute class\n            identifier (as above) suffixed by <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.18.7.2.5.2\">.attribute.</span> and then the identifier of\n            the attribute (e.g. <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.18.7.2.5.4\">att.editLike.attribute.resp</span>);</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.18.7.2.9\">when a parameterized schema is created, each element generates patterns for its\n            attributes and its contents separately, suffixing respectively <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.18.7.2.9.2\">.attributes</span>\n            and <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.18.7.2.9.4\">.contents</span> to the element name.</li>\n</ol>\n</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.20\" id=\"IMRN\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.20.3\">23.5.4 Making a RELAX NG Schema</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.5\">To create a RELAX NG schema, the processor processes every <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.5.2\" href=\"/ref/macroSpec\" target=\"\">macroSpec</a>,\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.5.4\" href=\"/ref/classSpec\" target=\"\">classSpec</a>, and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.5.6\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> in turn, creating a RELAX NG pattern for\n        each, using the naming conventions listed above. The order of declaration is not important,\n        and a processor may well sort them into alphabetical order of identifier.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.7\">A complete RELAX NG schema must have an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.7.2\" href=\"/ref/rng:start\" target=\"\">rng:start</a> element defining which elements\n        can occur as the root of a document. The ODD <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.7.4\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a> has an optional\n          start attribute, containing one or more patterns, which can be used to\n        construct the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.7.8\" href=\"/ref/rng:start\" target=\"\">rng:start</a>. A pattern normally corresponds to an element name, but if\n        a prefix (see above, <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.20.7.10\" emit=\"transcription\" hash=\"IM-naming\" xml-id=\"IM-naming\">23.5.3 Names and Documentation in Generated Schemas</pb-link>) is supplied for an element, the pattern\n        consists of the prefix name with the element name.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.20.9\" id=\"IMMA\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.20.9.3\">23.5.4.1 Macros</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.9.5\">An ODD macro generates a corresponding RELAX NG pattern by processing the body of the\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.9.5.2\" href=\"/ref/content\" target=\"\">content</a> element in the same way as elsewhere. Thus <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.9.5.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;macroSpec module=\"tei\" ident=\"macro.phraseSeq\"&gt;\n              &lt;content&gt;\n                &lt;alternate minOccurs=\"0\" maxOccurs=\"unbounded\"&gt;\n                  &lt;textNode/&gt;\n                  &lt;classRef key=\"model.gLike\"/&gt;\n                  &lt;classRef key=\"model.phrase\"/&gt;\n                  &lt;classRef key=\"model.global\"/&gt;\n                &lt;/alternate&gt;\n              &lt;/content&gt;\n            &lt;/macroSpec&gt;\n          </pb-code-highlight></div> produces the following <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.9.5.6\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"macro.phraseSeq\"&gt;\n              &lt;zeroOrMore&gt;\n                &lt;choice&gt;\n                  &lt;text/&gt;\n                  &lt;ref name=\"model.gLike\"/&gt;\n                  &lt;ref name=\"model.phrase\"/&gt;\n                  &lt;ref name=\"model.global\"/&gt;\n                &lt;/choice&gt;\n              &lt;/zeroOrMore&gt;\n            &lt;/define&gt;\n          </pb-code-highlight></div>\n</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.20.11\" id=\"IMCL\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.20.11.3\">23.5.4.2 Classes</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.11.5\">An ODD model class always generates a RELAX NG pattern definition listing all the members\n          of the class in alternation. For example <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.5.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;classSpec module=\"tei\" type=\"model\" ident=\"model.measureLike\"&gt;\n              &lt;!-- ... --&gt;\n            &lt;/classSpec&gt;\n          </pb-code-highlight></div> will produce something like the following: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.5.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"model.measureLike\"&gt;\n              &lt;choice&gt;\n                &lt;ref name=\"num\"/&gt;\n                &lt;ref name=\"measure\"/&gt;\n                &lt;ref name=\"measureGrp\"/&gt;\n              &lt;/choice&gt;\n            &lt;/define&gt;\n          </pb-code-highlight></div> assuming that the elements <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.5.6\" href=\"/ref/num\" target=\"\">num</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.5.8\" href=\"/ref/measure\" target=\"\">measure</a>, and\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.5.10\" href=\"/ref/measureGrp\" target=\"\">measureGrp</a> are all defined in the schema concerned as members of that class. A\n          model declaration may also generate a number of other patterns corresponding with\n          sequences or alternations of the class members: \n          <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.5.14\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"model.measureLike_sequence\"&gt;\n              &lt;ref name=\"num\"/&gt;\n              &lt;ref name=\"measure\"/&gt;\n              &lt;ref name=\"measureGrp\"/&gt;\n            &lt;/define&gt;\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"model.measureLike_sequenceOptional\"&gt;\n              &lt;rng:optional xmlns:rng=\"http://relaxng.org/ns/structure/1.0\"&gt;\n                &lt;ref name=\"num\"/&gt;\n              &lt;/rng:optional&gt;\n              &lt;rng:optional xmlns:rng=\"http://relaxng.org/ns/structure/1.0\"&gt;\n                &lt;ref name=\"measure\"/&gt;\n              &lt;/rng:optional&gt;\n              &lt;rng:optional xmlns:rng=\"http://relaxng.org/ns/structure/1.0\"&gt;\n                &lt;ref name=\"measureGrp\"/&gt;\n              &lt;/rng:optional&gt;\n            &lt;/define&gt;\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"model.measureLike_sequenceOptionalRepeatable\"&gt;\n              &lt;zeroOrMore&gt;\n                &lt;ref name=\"num\"/&gt;\n              &lt;/zeroOrMore&gt;\n              &lt;zeroOrMore&gt;\n                &lt;ref name=\"measure\"/&gt;\n              &lt;/zeroOrMore&gt;\n              &lt;zeroOrMore&gt;\n                &lt;ref name=\"measureGrp\"/&gt;\n              &lt;/zeroOrMore&gt;\n            &lt;/define&gt;\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"model.measureLike_sequenceRepeatable\"&gt;\n              &lt;oneOrMore&gt;\n                &lt;ref name=\"num\"/&gt;\n              &lt;/oneOrMore&gt;\n              &lt;oneOrMore&gt;\n                &lt;ref name=\"measure\"/&gt;\n              &lt;/oneOrMore&gt;\n              &lt;oneOrMore&gt;\n                &lt;ref name=\"measureGrp\"/&gt;\n              &lt;/oneOrMore&gt;\n            &lt;/define&gt;\n          </pb-code-highlight></div> where the pattern name is created by appending an underscore and the name of the\n          generation type to the class name. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.11.7\">When classes are referenced using the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.7.2\" href=\"/ref/classRef\" target=\"\">classRef</a> element, it is possible to\n          indicate which of the available patterns is required by means of the expand\n          attribute. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.11.9\">Attribute classes work by producing a pattern containing definitions of the appropriate\n          attributes. So <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.9.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;classSpec module=\"verse\" type=\"atts\" ident=\"att.enjamb\"&gt;\n              &lt;attList&gt;\n                &lt;attDef ident=\"enjamb\" usage=\"opt\"&gt;\n                  &lt;equiv/&gt;\n                  &lt;desc&gt;indicates whether the end of a verse line is marked by enjambement.&lt;/desc&gt;\n                  &lt;datatype&gt;\n                    &lt;dataRef key=\"teidata.enumerated\"/&gt;\n                  &lt;/datatype&gt;\n                  &lt;valList type=\"open\"&gt;\n                    &lt;valItem ident=\"no\"&gt;\n                      &lt;equiv/&gt;\n                      &lt;desc&gt;the line is end-stopped &lt;/desc&gt;\n                    &lt;/valItem&gt;\n                    &lt;valItem ident=\"yes\"&gt;\n                      &lt;equiv/&gt;\n                      &lt;desc&gt;the line in question runs on into the next &lt;/desc&gt;\n                    &lt;/valItem&gt;\n                    &lt;valItem ident=\"weak\"&gt;\n                      &lt;equiv/&gt;\n                      &lt;desc&gt;the line is weakly enjambed &lt;/desc&gt;\n                    &lt;/valItem&gt;\n                    &lt;valItem ident=\"strong\"&gt;\n                      &lt;equiv/&gt;\n                      &lt;desc&gt;the line is strongly enjambed&lt;/desc&gt;\n                    &lt;/valItem&gt;\n                  &lt;/valList&gt;\n                &lt;/attDef&gt;\n              &lt;/attList&gt;\n            &lt;/classSpec&gt;\n          </pb-code-highlight></div><pb-popover class=\"alternate tei-ex_egXML2 bibl-link\" data-tei=\"1.7.4.46.20.20.11.9.2\" id=\"altref_2\"><span slot=\"default\">bibliography</span><template slot=\"alternate\">Example is copied from the source of these <span class=\"tei-title4\" data-tei=\"1.7.6.12.5.4.672.3\">Guidelines</span>.</template></pb-popover> produces <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.9.4\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;rng:define xmlns:rng=\"http://relaxng.org/ns/structure/1.0\" name=\"att.enjamb.attributes\"&gt;\n              &lt;rng:ref name=\"att.enjamb.attribute.enjamb\"/&gt;\n              &lt;rng:empty/&gt;\n            &lt;/rng:define&gt;\n            &lt;rng:define xmlns:rng=\"http://relaxng.org/ns/structure/1.0\" name=\"att.enjamb.attribute.enjamb\"&gt;\n              &lt;rng:optional&gt;\n                &lt;rng:attribute name=\"enjamb\"&gt;\n                  &lt;a:documentation xmlns:a=\"http://relaxng.org/ns/compatibility/annotations/1.0\"&gt;(enjambement) indicates whether the end of a verse line is marked by\n                    enjambement. Sample values include: 1] no; 2] yes; 3] weak; 4]\n                    strong&lt;/a:documentation&gt;\n                  &lt;rng:ref name=\"teidata.enumerated\"/&gt;\n                &lt;/rng:attribute&gt;\n              &lt;/rng:optional&gt;\n            &lt;/rng:define&gt;\n          </pb-code-highlight></div> Since the processor may have expanded the attribute classes already, separate\n          patterns are generated for each attribute in the class as well as one for the class\n          itself. This allows an element to refer directly to a member of a class. Notice that the\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.9.6\" href=\"/ref/desc\" target=\"\">desc</a> element is used to add an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.9.8\" href=\"/ref/a:documentation\" target=\"\">a:documentation</a> element to the schema,\n          which some editors use to provide help during composition. The <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.9.10\" href=\"/ref/desc\" target=\"\">desc</a> elements in\n          the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.9.12\" href=\"/ref/valList\" target=\"\">valList</a> are used to create the human-readable sentence <span class=\"tei-quote1\" data-tei=\"1.7.4.46.20.20.11.9.14\">Sample values\n            include: 1] no; 2] yes; 3] weak; 4] strong</span> Naturally, this behaviour is not\n          mandatory; and other ODD processors may create documentation in other ways, or ignore\n          those parts of the ODD specifications when creating schemas.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.11.11\">An individual attribute consists of an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.11.2\" href=\"/ref/rng:attribute\" target=\"\">rng:attribute</a> with a name\n          attribute derived according to the naming rules described above (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.20.11.11.6\" emit=\"transcription\" hash=\"IM-naming\" xml-id=\"IM-naming\">23.5.3 Names and Documentation in Generated Schemas</pb-link>). In addition, the ODD model supports a <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.11.8\" href=\"/ref/defaultVal\" target=\"\">defaultVal</a>, which is transformed to a\n            defaultValue attribute in the namespace <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.20.11.11.12\">http://relaxng.org/ns/compatibility/annotations/1.0</span> on the\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.11.14\" href=\"/ref/rng:attribute\" target=\"\">rng:attribute</a>. The body of the attribute is taken from the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.11.16\" href=\"/ref/datatype\" target=\"\">datatype</a>\n          child, unless there is a supporting <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.11.18\" href=\"/ref/valList\" target=\"\">valList</a> with a type value of\n            closed. In that case an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.11.11.24\" href=\"/ref/rng:choice\" target=\"\">rng:choice</a> is created, listing the allowed\n          values. Thus the following attribute definition <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.11.26\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;attDef ident=\"full\" usage=\"opt\"&gt;\n              &lt;defaultVal&gt;yes&lt;/defaultVal&gt;\n              &lt;valList type=\"closed\"&gt;\n                &lt;valItem ident=\"yes\"&gt;\n                  &lt;desc&gt;the name component is spelled out in full.&lt;/desc&gt;\n                &lt;/valItem&gt;\n                &lt;valItem ident=\"abb\"&gt;\n                  &lt;gloss&gt;abbreviated&lt;/gloss&gt;\n                  &lt;desc&gt;the name component is given in an abbreviated form.&lt;/desc&gt;\n                &lt;/valItem&gt;\n                &lt;valItem ident=\"init\"&gt;\n                  &lt;gloss&gt;initial letter&lt;/gloss&gt;\n                  &lt;desc&gt;the name component is indicated only by one initial.&lt;/desc&gt;\n                &lt;/valItem&gt;\n              &lt;/valList&gt;\n            &lt;/attDef&gt;\n          </pb-code-highlight></div> may generate this RELAX NG code: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.20.11.11.28\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n            &lt;define xmlns=\"http://relaxng.org/ns/structure/1.0\" name=\"att.full\"&gt;\n              &lt;rng:optional xmlns:rng=\"http://relaxng.org/ns/structure/1.0\"&gt;\n                &lt;attribute xmlns:a=\"http://relaxng.org/ns/compatibility/annotations/1.0\" name=\"full\" a:defaultValue=\"yes\"&gt;\n                  &lt;choice&gt;\n                    &lt;value&gt;yes&lt;/value&gt;\n                    &lt;a:documentation&gt; the name component is spelled out in full. &lt;/a:documentation&gt;\n                    &lt;value&gt;abb&lt;/value&gt;\n                    &lt;a:documentation&gt; the name component is given in an abbreviated form. &lt;/a:documentation&gt;\n                    &lt;value&gt;init&lt;/value&gt;\n                    &lt;a:documentation&gt; the name component is indicated only by one initial.\n                    &lt;/a:documentation&gt;\n                  &lt;/choice&gt;\n                &lt;/attribute&gt;\n              &lt;/rng:optional&gt;\n            &lt;/define&gt;\n          </pb-code-highlight></div> Note the use of the <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.20.11.11.30\">http://relaxng.org/ns/compatibility/annotations/1.0</span> namespace to provide\n          default values and documentation. </p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.20.13\" id=\"IMEL\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.20.13.3\">23.5.4.3 Elements</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.13.5\">An <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.13.5.2\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a> produces a RELAX NG specification in two parts; firstly, it must\n          generate an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.13.5.4\" href=\"/ref/rng:define\" target=\"\">rng:define</a> pattern by which other elements can refer to it, and then\n          it must generate an <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.13.5.6\" href=\"/ref/rng:element\" target=\"\">rng:element</a> with the content model and attributes. It may be\n          convenient to make two separate patterns, one for the element's attributes and one for its\n          content model.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.20.13.7\">The content model is created by processing the TEI declarations found within the\n            <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.20.13.7.2\" href=\"/ref/content\" target=\"\">content</a> element; ; the attributes are processed in the same way as those from\n          attribute classes, described above.</p>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.22\" id=\"IM-makeDTD\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.22.3\">23.5.5 Making a DTD</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.22.5\">Generation of DTDs largely follows the same pattern as RELAX NG generation, with one\n        important exception<span class=\"tei-hi2\" data-tei=\"1.7.4.46.20.22.5.2\">the order of declaration matters</span>. A DTD may not refer to an\n        entity which has not yet been declared. Since both macros and classes generate DTD parameter\n        entities, the TEI Guidelines are constructed so that they can be declared in the right\n        order. A processor must therefore work in the following order: <ol class=\"tei-list1 numbered\" data-tei=\"1.7.4.46.20.22.5.4\">\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.22.5.4.3\">declare all model classes which have a predeclare value of\n              true</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.22.5.4.5\">declare all macros which have a predeclare value of\n            true</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.22.5.4.7\">declare all other classes</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.22.5.4.9\">declare the modules (if DTD fragments are being constructed)</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.22.5.4.11\">declare any remaining macros</li>\n<li class=\"tei-item\" data-tei=\"1.7.4.46.20.22.5.4.13\">declare the elements and their attributes</li>\n</ol>\n</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.22.7\">Let us consider a complete example, a simple element with no attributes of its own: <div class=\"tei-ex_egXML1\" data-tei=\"1.7.4.46.20.22.7.2\"><pb-code-highlight language=\"xml\" theme=\"solarizedlight\">\n          &lt;elementSpec module=\"namesdates\" ident=\"faith\"&gt;\n            &lt;desc&gt;specifies the faith, religion, or belief set of a person.&lt;/desc&gt;\n            &lt;classes&gt;\n              &lt;memberOf key=\"model.persStateLike\"/&gt;\n              &lt;memberOf key=\"att.editLike\"/&gt;\n              &lt;memberOf key=\"att.datable\"/&gt;\n            &lt;/classes&gt;\n            &lt;content&gt;\n              &lt;macroRef key=\"macro.phraseSeq\"/&gt;\n            &lt;/content&gt;\n          &lt;/elementSpec&gt;\n        </pb-code-highlight></div> If DTD fragments are being generated (for use as described in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.22.7.4\" emit=\"transcription\" hash=\"STPE\" xml-id=\"STPE\">23.5.7 Using TEI Parameterized Schema Fragments</pb-link>), this will result in the following:\n        <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.22.7.6\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % faith 'INCLUDE' &gt;\n&lt;![ %faith; [\n\n&lt;!--doc:specifies the faith,  religion, or belief set of a person. --&gt;\n&lt;!ELEMENT %n.faith; %om.RR; %macro.phraseSeq;&gt;\n&lt;!ATTLIST %n.faith; xmlns CDATA \"http://www.tei-c.org/ns/1.0\"&gt;\n&lt;!ATTLIST %n.faith;\n %att.global.attributes;\n %att.editLike.attributes;\n %att.datable.attributes; &gt;\n]]&gt;</template></pb-code-highlight></div> Here the whole stanza is contained in a marked section (for use as described in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.22.7.8\" emit=\"transcription\" hash=\"STPEEX\" xml-id=\"STPEEX\">23.5.7.2 Inclusion and Exclusion of Elements</pb-link>), the element name is parameterized (see <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.22.7.10\" emit=\"transcription\" hash=\"STPEGI\" xml-id=\"STPEGI\">23.5.7.3 Changing the Names of Generic Identifiers</pb-link>), and\n        the class attributes are entity references derived from the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.22.7.12\" href=\"/ref/memberOf\" target=\"\">memberOf</a> records in\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.22.7.14\" href=\"/ref/classes\" target=\"\">classes</a>. Note the additional attribute which provides a default xmlns declaration for the element; the effect of this is that if the document is\n        processed by a DTD-aware XML processor, the namespace declaration will be present\n        automatically without the document author even being aware of it.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.22.9\">A simpler rendition for a flattened DTD generated from a customization will result in the\n        following, with no containing marked section, and no parameterized name:\n        <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.22.9.2\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ELEMENT faith %macro.phraseSeq;&gt;\n&lt;!ATTLIST faith xmlns CDATA \"http://www.tei-c.org/ns/1.0\"&gt;\n&lt;!ATTLIST faith\n %att.global.attribute.xmlspace;\n %att.global.attribute.xmlid;\n %att.global.attribute.n;\n %att.global.attribute.xmllang;\n %att.global.attribute.rend;\n %att.global.attribute.xmlbase;\n %att.global.linking.attribute.corresp;\n %att.global.linking.attribute.synch;\n %att.global.linking.attribute.sameAs;\n %att.global.linking.attribute.copyOf;\n %att.global.linking.attribute.next;\n %att.global.linking.attribute.prev;\n %att.global.linking.attribute.exclude;\n %att.global.linking.attribute.select;\n %att.editLike.attribute.cert;\n %att.editLike.attribute.resp;\n %att.editLike.attribute.evidence;\n %att.datable.w3c.attribute.period;\n %att.datable.w3c.attribute.when;\n %att.datable.w3c.attribute.notBefore;\n %att.datable.w3c.attribute.notAfter;\n %att.datable.w3c.attribute.from;\n %att.datable.w3c.attribute.to;&gt;</template></pb-code-highlight></div> Here the attributes from classes have been expanded into individual entity references.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.24\" id=\"IMGD\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.24.3\">23.5.6 Generating Documentation</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.24.5\">In Donald Knuth's literate programming terminology (<pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.24.5.2\" emit=\"transcription\" hash=\"KNUTH\" xml-id=\"KNUTH\">1 </pb-link>), the previous\n        sections have dealt with the <span class=\"tei-term\" data-tei=\"1.7.4.46.20.24.5.4\">tangle</span> process; to generate documentation, we now\n        turn to the <span class=\"tei-term\" data-tei=\"1.7.4.46.20.24.5.6\">weave</span> process.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.24.7\">An ODD customization may consist largely of general documentation and examples, requiring\n        no ODD-specific processing. It will normally however also contain a <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.7.2\" href=\"/ref/schemaSpec\" target=\"\">schemaSpec</a>\n        element and possibly some <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.7.4\" href=\"/ref/specGrp\" target=\"\">specGrp</a> fragments.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.24.9\"> The generated documentation may be of two forms. On the one hand, we may document the\n        customization itself, that is, only those elements (etc.) which differ in their\n        specification from that provided by the TEI reference documentation. Alternatively, we may\n        generate reference documentation for the complete subset of the TEI which results from\n        applying the customization. The TEI Roma tools take the latter approach, and operate on the\n        result of the first stage processing described in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.24.9.2\" emit=\"transcription\" hash=\"IM-unified\" xml-id=\"IM-unified\">23.5.1 Making a Unified ODD</pb-link>.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.24.11\">Generating reference documentation for <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.11.2\" href=\"/ref/elementSpec\" target=\"\">elementSpec</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.11.4\" href=\"/ref/classSpec\" target=\"\">classSpec</a>, and\n          <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.11.6\" href=\"/ref/macroSpec\" target=\"\">macroSpec</a> elements is largely dependent on the design of the preferred output.\n        Some applications may, for example, want to turn all names of objects into hyperlinks, show\n        lists of class members, or present lists of attributes as tables, lists, or inline prose.\n        Another technique implemented in these Guidelines is to show lists of potential\n          parents for each element, by tracing which other elements have them\n        as possible members of their content models.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.24.13\">One model of display on a web page is shown in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.24.13.2\" emit=\"transcription\" hash=\"ref-faith\" xml-id=\"ref-faith\">23.5.6.1 Example reference documentation for faith</pb-link>, corresponding to\n        the <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.13.4\" href=\"/ref/faith\" target=\"\">faith</a> element shown in section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.24.13.6\" emit=\"transcription\" hash=\"IM-makeDTD\" xml-id=\"IM-makeDTD\">23.5.5 Making a DTD</pb-link>.</p>\n<div class=\"tei-figure1\" data-tei=\"1.7.4.46.20.24.15\" id=\"ref-faith\">\n<img class=\"tei-graphic\" data-tei=\"1.7.4.46.20.24.15.3\" src=\"https://tei-c.org/release/doc/tei-p5-doc/en/html/Images/ref-faith.png\" style=\"width: 450px; \" title=\"\"/>\n<div class=\"tei-head4\" data-tei=\"1.7.4.46.20.24.15.5\">Example reference documentation for <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.24.15.5.2\" href=\"/ref/faith\" target=\"\">faith</a></div>\n</div>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.30\" id=\"STPE\">\n<h3 class=\"tei-head9\" data-tei=\"1.7.4.46.20.30.3\">23.5.7 Using TEI Parameterized Schema Fragments</h3>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.5\">The TEI parameterized DTD and RELAX NG fragments make use of parameter entities and\n        patterns for several purposes. In this section we describe their interface for the user. In\n        general we recommend use of ODD instead of this technique, which has been retained only for\n        compatability reasons.</p>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.30.7\" id=\"STPED\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.30.7.4\">23.5.7.1 Selection of Modules</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.7.6\">Special-purpose parameter entities are used to specify which modules are to be combined\n          into a TEI DTD. They take the form TEI.xxxxx where <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.30.7.6.4\">xxxx</span> is the\n          name of the module as given in table <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.30.7.6.6\" emit=\"transcription\" hash=\"tab-mods\" xml-id=\"tab-mods\">1 </pb-link> in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.30.7.6.8\" emit=\"transcription\" hash=\"STMA\" xml-id=\"STMA\">1.1 TEI Modules</pb-link>.\n          For example, the parameter entity <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.6.10\">TEI.linking</span> is used to define\n          whether or not to include the module <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.30.7.6.12\"><a href=\"/ref/linking\">linking</a></span>. All such\n          parameter entities are declared by default with the value IGNORE: to select a\n          module, therefore, the encoder declares the appropriate parameter entities with the value\n            INCLUDE. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.7.8\">For XML DTD fragments, note that some modules generate two DTD fragments: for example the\n            <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.30.7.8.2\"><a href=\"/ref/analysis\">analysis</a></span> module generates fragments called <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.8.4\">analysis-decl</span> and <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.8.6\">analysis</span>. This is\n          because the declarations they contain are needed at different points in the creation of an\n          XML DTD. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.7.10\">The parameter entity named for the module is used as the keyword controlling a\n          conditional marked section in the DTD fragment generated by the <span class=\"tei-ident1\" data-tei=\"1.7.4.46.20.30.7.10.2\"><a href=\"/ref/tei\">tei</a></span> module. The declarations for each DTD fragment constituting the module are\n          contained within such marked sections. For example, the parameter entity <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.10.4\">TEI.linking</span> appears twice in <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.10.6\">tei.dtd</span>, once for the\n            <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.10.8\">linking-decl</span> schema fragment:\n          <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.7.10.10\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % TEI.linking 'IGNORE' &gt;\n&lt;![%TEI.linking;[\n&lt;!ENTITY % file.linking-decl PUBLIC '-//TEI P5//ENTITIES Linking, Segmentation, and Alignment//EN' 'linking-decl.dtd' &gt;\n%file.linking-decl;\n]] &gt;</template></pb-code-highlight></div> and once for the <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.10.12\">linking</span> schema fragment:\n          <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.7.10.14\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;![%TEI.linking;[\n&lt;!ENTITY % file.linking PUBLIC '-//TEI P5//ELEMENTS Linking, Segmentation, and Alignment//EN' 'linking.dtd' &gt;\n%file.linking;]] &gt;</template></pb-code-highlight></div> If TEI.linking has its default value of IGNORE, neither declaration has any effect. If\n          however it has the value INCLUDE, then the content of each marked section is acted upon:\n          the parameter entities <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.10.16\">file.linking</span> and <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.7.10.18\">file.linking-decl</span> are referenced, which has the effect of embedding the content\n          of the files they represent at the appropriate point in the DTD. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.7.12\">The RELAX NG schema fragments can be combined in a wrapper schema using the standard\n          mechanism of <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.7.12.2\" href=\"/ref/rng:include\" target=\"\">rng:include</a> in that language.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.30.9\" id=\"STPEEX\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.30.9.4\">23.5.7.2 Inclusion and Exclusion of Elements</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.9.6\">The TEI DTD fragments also use marked sections and parameter entity references to allow\n          users to exclude the definitions of individual elements, in order either to make the\n          elements illegal in a document or to allow the element to be redefined. The parameter\n          entities used for this purpose have exactly the same name as the generic identifier of the\n          element concerned. The default definition for these parameter entities is\n            INCLUDE but they may be changed to IGNORE in order to exclude the\n          standard element and attribute definition list declarations from the DTD. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.9.8\">The declarations for the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.9.8.2\" href=\"/ref/p\" target=\"\">p</a>, for example, are preceded by a definition\n          for a parameter entity with the name <span class=\"tei-ident2 noindex\" data-tei=\"1.7.4.46.20.30.9.8.4\">p</span> and\n          contained within a marked section whose keyword is given as <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.30.9.8.6\">%p;</span>: <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.9.8.8\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % p 'INCLUDE' &gt;\n&lt;![ %p; [\n       &lt;!-- element and attribute list declaration for p here --&gt;\n]]</template></pb-code-highlight></div></p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.9.10\">These parameter entities are defined immediately preceding the element whose declarations\n          they control; because their names are completely regular, they are not documented further. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.9.12\">To define a DTD in which the element <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.9.12.2\" href=\"/ref/p\" target=\"\">p</a> is excluded therefore, the entity <span class=\"tei-ident2 noindex\" data-tei=\"1.7.4.46.20.30.9.12.4\">p</span> needs to be redefined as IGNORE by\n          ensuring that a declaration such as\n          <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.9.12.8\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % p 'IGNORE' &gt;</template></pb-code-highlight></div> is added earlier in the\n          DTD than the default (see further <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.30.9.12.10\" emit=\"transcription\" hash=\"STOVLO\" xml-id=\"STOVLO\">23.5.7.4 Embedding Local Modifications (DTD only)</pb-link>). </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.9.14\">Similarly, in the parameterized RELAX NG schemas, every element is defined by a pattern\n          named after the element. To undefine an element therefore all that is necessary is to add\n          a declaration like the following:\n          <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.9.14.2\"><pb-code-highlight theme=\"solarizedlight\"><template> p = notAllowed </template></pb-code-highlight></div>\n</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.30.11\" id=\"STPEGI\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.30.11.4\">23.5.7.3 Changing the Names of Generic Identifiers</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.11.6\">In the TEI DTD fragments, elements are not referred to directly by their generic\n          identifiers; instead, the DTD fragments refer to parameter entities which expand to the\n          standard generic identifiers. This allows users to rename elements by redefining the\n          appropriate parameter entity. Parameter entities used for this purpose are formed by\n          taking the standard generic identifier of the element and attaching the string\n            n. as a prefix. Thus the standard generic identifiers for paragraphs, notes,\n          and quotations, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.11.6.4\" href=\"/ref/p\" target=\"\">p</a>, <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.11.6.6\" href=\"/ref/note\" target=\"\">note</a>, and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.11.6.8\" href=\"/ref/persName\" target=\"\">persName</a> are defined by\n          declarations of the following form: <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.11.6.10\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % n.p \"p\"&gt;\n&lt;!ENTITY % n.note \"note\"&gt; \n&lt;!ENTITY % n.persName \"persName\"&gt;</template></pb-code-highlight></div> Note that since all names are case-sensitive, the specific\n          mix of uppercase and lowercase letters in the standard generic identifier must be\n          preserved in the entity name. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.11.8\">These declarations are generated by an ODD processor when TEI DTD fragments are created. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.11.10\"> In the RELAX NG schemas, all elements are normally defined using a pattern with the same\n          name as the element (as described in <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.30.11.10.2\" emit=\"transcription\" hash=\"IM-naming\" xml-id=\"IM-naming\">23.5.3 Names and Documentation in Generated Schemas</pb-link>): for example\n          <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.11.10.4\"><pb-code-highlight theme=\"solarizedlight\"><template>abbr = element abbr { abbr.content, abbr.attributes }</template></pb-code-highlight></div> The easiest way of renaming the element is thus simply to rewrite the pattern with a\n          different element name; any references use the pattern, not the element, name.\n          <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.11.10.6\"><pb-code-highlight theme=\"solarizedlight\"><template>abbr = element abbrev { abbr.content, abbr.attributes }</template></pb-code-highlight></div> More complex revisions, such as redefining the content of the element (defined by the\n          pattern <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.11.10.8\">abbr.content</span>) or its attributes (defined by the pattern\n            <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.11.10.10\">abbr.attributes</span>) can be accomplished in a similar way, using\n          the features of the RELAX NG language. The recommended method of carrying out such\n          modifications is however to use the ODD language as further described in section <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.30.11.10.12\" emit=\"transcription\" hash=\"TD\" xml-id=\"TD\">22 Documentation Elements</pb-link>.</p>\n</div>\n<div class=\"tei-div10\" data-tei=\"1.7.4.46.20.30.13\" id=\"STOVLO\">\n<h4 class=\"tei-head9\" data-tei=\"1.7.4.46.20.30.13.4\">23.5.7.4 Embedding Local Modifications (DTD only)</h4>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.6\">Any local modifications to a DTD (i.e. changes to a schema other than simple inclusion or\n          exclusion of modules) are made by declarations stored in one of two local extension files,\n          one containing modifications to the TEI parameter entities, and the other new or changed\n          declarations of elements and their attributes. Entity declarations must be made which\n          associate the names of these two files with the appropriate parameter entity so that the\n          declarations they contain can be embedded within the TEI DTD at an appropriate point.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.8\">The following entities are referred to by the main <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.8.2\">tei.dtd</span>\n          file to embed portions of the TEI DTD fragments or locally developed extensions. <dl class=\"tei-list3\" data-tei=\"1.7.4.46.20.30.13.8.4\"><dt data-tei=\"1.7.4.46.20.30.13.8.4.5\"><span class=\"tei-label\" data-tei=\"1.7.4.46.20.30.13.8.4.3\"><span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.8.4.3.1\">TEI.extensions.ent</span></span></dt><dd data-tei=\"1.7.4.46.20.30.13.8.4.5\">identifies a local file containing extensions to the TEI parameter entities</dd><dt data-tei=\"1.7.4.46.20.30.13.8.4.9\"><span class=\"tei-label\" data-tei=\"1.7.4.46.20.30.13.8.4.7\"><span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.8.4.7.1\">TEI.extensions.dtd</span></span></dt><dd data-tei=\"1.7.4.46.20.30.13.8.4.9\">identifies a local file containing extensions to the TEI module</dd></dl></p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.10\">For example, if the relevant files are called <span class=\"tei-ident2 noindex\" data-tei=\"1.7.4.46.20.30.13.10.2\">project.ent</span> and <span class=\"tei-ident2 noindex\" data-tei=\"1.7.4.46.20.30.13.10.4\">project.dtd</span>, then\n          declarations like the following would be appropriate: <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.13.10.6\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % TEI.extensions.ent SYSTEM 'project.ent' &gt;\n&lt;!ENTITY % TEI.extensions.dtd SYSTEM 'project.dtd' &gt;</template></pb-code-highlight></div></p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.12\">When an entity is declared more than once, the first declaration is binding and the\n          others are ignored. The local modifications to parameter entities should therefore be\n          handled before the standard parameter entities themselves are declared in <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.12.2\">tei.dtd</span>. The entity <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.12.4\">TEI.extensions.ent</span> is\n          referred to before any TEI declarations are handled, to allow the user's declarations to\n          take priority. If the user does not provide a <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.12.6\">TEI.extensions.ent</span>\n          entity, the entity will be expanded to the empty string.</p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.14\">For example the encoder might wish to add two phrase-level elements <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.13.14.2\" href=\"/ref/it\" target=\"\">it</a> and <a class=\"tei-gi\" data-tei=\"1.7.4.46.20.30.13.14.4\" href=\"/ref/bd\" target=\"\">bd</a>, perhaps as synonyms for\n            hi rend='italics' and hi rend='bold'. As described in chapter <pb-link class=\"inner-ref\" data-tei=\"1.7.4.46.20.30.13.14.10\" emit=\"transcription\" hash=\"MD\" xml-id=\"MD\">23.3 Customization</pb-link>, this involves two distinct steps: one to define the new elements, and\n          the other to ensure that they are placed into the TEI document structure at the right\n          place. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.16\">Creating the new declarations is done in the same way for user-defined elements as for\n          any other; the same parameter entities need to be defined so that they may be referenced\n          by other elements. The content models of these new elements may also reference other\n          parameter entities, which is why they need to be declared after other declarations. </p>\n<p class=\"tei-p\" data-tei=\"1.7.4.46.20.30.13.18\">The second step involves modifying the element class to which the new elements should be\n          attached. This requires that the parameter entity <span class=\"tei-ident2\" data-tei=\"1.7.4.46.20.30.13.18.2\">macro.phraseSeq</span>\n          should be modified to include the generic identifiers for the new elements we wish to\n          create. The declaration for each modifiable parameter entity in the DTD includes a\n          reference to an additional parameter entity with the same name prefixed by an\n            <span class=\"tei-code2 code\" data-tei=\"1.7.4.46.20.30.13.18.4\">x.</span>; these entities are declared by default as the null string. However, in\n          the file containing local declarations they may be redeclared to include references to the\n          new class members: <div class=\"tei-eg example\" data-tei=\"1.7.4.46.20.30.13.18.6\"><pb-code-highlight theme=\"solarizedlight\"><template>&lt;!ENTITY % x.macro.phraseSeq 'it | bd\n|'&gt;</template></pb-code-highlight></div> and this declaration will take precedence over the default when the declaration for\n          macro.phraseSeq is evaluated. </p>\n</div>\n</div>\n</div>\n</section><div class=\"popovers\"></div></div>", "footnotes": "<!DOCTYPE html>\n<div class=\"footnotes\"><dl class=\"footnote\" id=\"fn_1_7_4_46_16_22_14_6_24\"><dt class=\"fn-number\">1</dt><dd data-tei=\"1.7.4.46.16.22.14.6.24\" class=\"fn-content\">Excluding\n              <span data-tei=\"1.7.4.46.16.22.14.6.24.3\" class=\"tei-ident1\"><a href=\"ref/model.gLike\">model.gLike</a></span> is generally inadvisable however, since\n            without it the resulting schema has no way of referencing non-Unicode characters.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_16_22_14_6_24\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_16_24_6_6\"><dt class=\"fn-number\">2</dt><dd data-tei=\"1.7.4.46.16.24.6.6\" class=\"fn-content\">This is not strictly the case,\n          since the element <a data-tei=\"1.7.4.46.16.24.6.6.3\" href=\"ref/egXML\" class=\"tei-gi\" target=\"\">egXML</a> used to represent TEI examples has its own namespace,\n            http://www.tei-c.org/ns/Examples; this is the only exception however. <a class=\"fn-back\" href=\"#fnref_1_7_4_46_16_24_6_6\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_16_24_14_4\"><dt class=\"fn-number\">3</dt><dd data-tei=\"1.7.4.46.16.24.14.4\" class=\"fn-content\">Full namespace support does not exist in\n          the DTD language, and therefore these techniques are available only to users of more\n          modern schema languages such as RELAX NG or W3C Schema.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_16_24_14_4\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_16_26_6_12\"><dt class=\"fn-number\">4</dt><dd data-tei=\"1.7.4.46.16.26.6.12\" class=\"fn-content\">This module can be used to document any XML\n          schema, and has indeed been used to document several non-TEI schemas.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_16_26_6_12\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_18_20_8_2\"><dt class=\"fn-number\">5</dt><dd data-tei=\"1.7.4.46.18.20.8.2\" class=\"fn-content\">Here and elsewhere we use the word <span data-tei=\"1.7.4.46.18.20.8.2.3\" class=\"tei-mentioned\">schema</span> to refer\n          to any formal document grammar language, irrespective of the formalism used to represent\n          it.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_18_20_8_2\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_20_14_7_4_5_14\"><dt class=\"fn-number\">6</dt><dd data-tei=\"1.7.4.46.20.14.7.4.5.14\" class=\"fn-content\">An ODD processor should recognize as\n              erroneous such obvious inconsistencies as an attempt to include an\n                <a data-tei=\"1.7.4.46.20.14.7.4.5.14.3\" href=\"ref/elementSpec\" class=\"tei-gi\" target=\"\">elementSpec</a> in add mode for an element which is already present\n              in an imported module.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_20_14_7_4_5_14\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_20_14_19_2\"><dt class=\"fn-number\">7</dt><dd data-tei=\"1.7.4.46.20.14.19.2\" class=\"fn-content\">The carthago program behind the\n          Pizza Chef application, written by Michael Sperberg-McQueen for TEI P3 and P4, went to\n          very great efforts to get this right. The XSLT transformations used by the P5 Roma\n          application are not as sophisticated, partly because the RELAX NG language is more\n          forgiving than DTDs.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_20_14_19_2\"></a></dd></dl><dl class=\"footnote\" id=\"fn_1_7_4_46_20_14_21_6\"><dt class=\"fn-number\">8</dt><dd data-tei=\"1.7.4.46.20.14.21.6\" class=\"fn-content\">Note that deletion of\n          required elements will cause the schema specification to accept as valid documents which\n          cannot be TEI-conformant, since they no longer conform to the TEI Abstract Model;\n          conformance topics are addressed in more detail in <pb-link data-tei=\"1.7.4.46.20.14.21.6.3\" class=\"inner-ref\" xml-id=\"CF\" hash=\"CF\" emit=\"transcription\">23.4 Conformance</pb-link>.<a class=\"fn-back\" href=\"#fnref_1_7_4_46_20_14_21_6\"></a></dd></dl></div>", "userParams": {"track-ids": "True", "webcomponents": 7, "lng": "en"}, "collection": ""}