{"format": "json", "view": "single", "doc": "p5.xml", "root": null, "rootNode": "1.7.4.2.29.10.16.8", "id": null, "odd": "tei.odd", "next": null, "previous": null, "nextId": null, "previousId": null, "switchView": null, "content": "<!DOCTYPE html>\n\n<div class=\"content\">\n<span class=\"tei-desc2\">defines the range of attribute values used for numeric values.</span>\n<tr><td>Note</td><td>\n<p class=\"tei-p\">Any numeric value, represented as a decimal number, in floating point format, or as a ratio.</p>\n<p class=\"tei-p\">To represent a floating point number, expressed in scientific notation, E\n      notation, a variant of exponential notation, may be used. In\n      this format, the value is expressed as two numbers separated by the letter E. The first\n      number, the significand (sometimes called the mantissa) is given in decimal format, while the\n      second is an integer. The value is obtained by multiplying the mantissa by 10 the number of\n      times indicated by the integer. Thus the value represented in decimal notation as 1000.0 might\n      be represented in scientific notation as 10E3.</p>\n<p class=\"tei-p\">A value expressed as a ratio is represented by two integer values separated by a solidus (/)\n      character. Thus, the value represented in decimal notation as 0.5 might be represented as a\n      ratio by the string 1/2.</p>\n</td></tr>\n<tr><td>Note</td><td>\n<p class=\"tei-p\"> 10進数を作る数値． </p>\n<p class=\"tei-p\"> また，IEEE倍精度浮動小数点(64bit長)をとることもできる．例えば， ±10⁻³²³ から ±10³⁰⁸など． </p>\n<p class=\"tei-p\"> 科学的数値を評点する際，指数表現は，属性値と して記述される．\n      10進数による仮数部，続いて記号<span class=\"tei-mentioned\">E</span>，続いて指数 部がくる．\n      \n        乗算記号と底(<span class=\"tei-mentioned\">10</span>)は省略される．仮数部と指数 部には負になるかもしれない．記号<span class=\"tei-mentioned\">E</span>と指数部を\n      分けるために空白文字を入れる必要はない．例えば，3×10⁸ は 3E8と書かれる． </p>\n<p class=\"tei-p\"> 他の例として，以下のようなものがある． <ul class=\"tei-list3\"><li class=\"tei-item\">\n               3E10 (光の速度(cm/秒))</li><li class=\"tei-item\">\n               9.12E-31 (電子の質量(kg))</li><li class=\"tei-item\">\n               4E11 (銀河系にある恒星の数(推定値))</li><li class=\"tei-item\">\n               -1.76E11 (電子の電荷(クローン))</li></ul>\n</p>\n<p class=\"tei-p\"> 仮数部と指数部を分ける記号は<span class=\"tei-mentioned\">e</span>または <span class=\"tei-mentioned\">E</span>のどちらでもよいが，当ガイドラインでは\n        <span class=\"tei-mentioned\">E</span>を使うことを推奨する．これは，他の規格との 整合性を保ち，数学における定数との混同を避けるためである． </p>\n</td></tr>\n<tr><td>Note</td><td>\n<p class=\"tei-p\"> Toute valeur numérique, représentée en nombre décimal, notée en virgule flottante ou\n      en fraction.</p>\n<p class=\"tei-p\">Pour représenter un nombre en virgule flottante, exprimé en notation scientifique,\n        E notation, une variante de la notation\n      exponentielle peut être utilisée. Dans ce format, la valeur est exprimée par deux\n      nombres séparés par la lettre E. Le premier facteur, le significande (parfois appelé mantisse)\n      est donné sous forme décimale, tandis que le second est un entier. La valeur est obtenue en\n      multipliant la mantisse par 10 fois le nombre indiqué par l'entier. Ainsi la valeur\n      représentée en notation décimale 1000.0 pourrait être représentée en notation\n      scientifique 10E3.</p>\n<p class=\"tei-p\">Une valeur exprimée en fraction est représentée par deux nombres entiers séparés par une\n      barre oblique (/). Ainsi, la valeur représentée en notation décimale 0.5 pourrait être\n      représentée en fraction par la chaîne de caractères 1/2.</p>\n</td></tr>\n</div>", "footnotes": "", "userParams": {"mode": "ref", "webcomponents": 7, "lng": "en"}, "collection": ""}